{"data":[{"message":"Arizona History . . . look at the building in the background.   100 years ago, just 4 years after we became a State.","created_time":"2016-06-15T16:46:57+0000","id":"113373749451_10208698153963623"},{"message":"Women influence 67% of household investment decisions. So how can they secure their financial future as well?","created_time":"2016-06-15T15:57:07+0000","id":"113373749451_10154265786834452"},{"message":"We are deeply saddened by the unimaginable act of violence in Orlando. Our thoughts are with the victims and their families. Around the world, NYL is #OrlandoUnited.","created_time":"2016-06-14T11:41:36+0000","id":"113373749451_10154262720154452"},{"message":"One of your sales associates interrupted my dinner this evening. She came to the door of my home and when my husband and I tried to politely decline, she persisted. We didn't reply to your bombardment of mailers, so we're clearly not interested in your services. Sending someone to my home during dinner time is certainly not going to win my business.","created_time":"2016-06-13T23:39:59+0000","id":"113373749451_10154261728654452"},{"message":"Volunteers from New York Life Insurance Company were at Fernside Friday afternoon doing a lot of GOOD for Fernside! Thanks to all the New York Life staffers who took time out of their busy day to support the grieving children and families in Cincinnati!","story":"Fernside: A Center for Grieving Children added 3 new photos.","created_time":"2016-06-13T20:58:18+0000","id":"113373749451_10154261374429452"},{"message":"Part of what makes Camp Forget-Me-Not/Camp Erin DC truly special are the personalized touches our campers receive. From the interaction with their buddy to the smaller items that they can take home that remind them of their healing experience at camp. \n\nToday, New York Life Insurance Company employees, led by camp volunteer Dominique Duong, generously donated blankets and hand-made luggage tags to our campers. We are so grateful for their time and commitment to camp!","story":"Wendt Center for Loss and Healing added 2 new photos.","created_time":"2016-06-13T20:44:38+0000","id":"113373749451_10154261342944452"},{"message":"Weigh in: Will Social Security be there for Millenials in the future?","created_time":"2016-06-13T19:32:51+0000","id":"113373749451_10154261165389452"},{"message":"We welcome the new partnership with New York Life Las Vegas General Office, who assisted at Camp Erin Las Vegas with logistics and providing campers with snacks and sundries. They loved interacting with the campers and look forward to expanding the partnership in 2017! Thank you, New York Life Insurance Company! #NYLVolunteers","story":"The Moyer Foundation added 2 new photos.","created_time":"2016-06-13T19:11:42+0000","id":"113373749451_10154261125149452"},{"message":"Another amazing day at New York Life Insurance Company! We made SoaringDreamCatchers for hospitalized children to inspire them to “dream big!” Thank you to our fantastic team-leads: Alexandra Capodieci, Jeanette Liberto\nand Allison Klasson!","story":"Soaringwords added 23 new photos.","created_time":"2016-06-13T17:46:41+0000","id":"113373749451_10154260936339452"},{"message":"Team New York Life Insurance Company","created_time":"2016-06-10T17:15:35+0000","id":"113373749451_10154252633139452"},{"message":"SCAM ALERT! Is there an email address I can forward these emails to so that your security team can investigate?","created_time":"2016-06-10T16:25:54+0000","id":"113373749451_10153548744072797"},{"message":"New York Life is not the company you keep, it is THE COMAPNY THAT KEEPS YOUR MONEY!","created_time":"2016-06-10T14:01:54+0000","id":"113373749451_10154252223654452"},{"message":"Dad always says: The best things in life are free (and handmade!). #FathersDay","created_time":"2016-06-10T14:00:15+0000","id":"113373749451_10154252218754452"},{"message":"New York Life Insurance Company Erin Furman","created_time":"2016-06-10T13:45:44+0000","id":"113373749451_10154252192559452"},{"message":"If the insured dies, will the beneficiaries receive both the Death Benefit of the Whole Life Policy and the Cash Surrender Value (CSV)?","created_time":"2016-06-09T23:40:02+0000","id":"113373749451_10154250636309452"},{"message":"Why are we the top mutual insurer? #Fortune500","created_time":"2016-06-09T20:19:42+0000","id":"113373749451_10154250113389452"},{"message":"Why are we the top mutual insurer? #Fortune500","created_time":"2016-06-09T20:12:28+0000","id":"113373749451_10154250091624452"},{"message":"When it comes to retirement planning, people often have 3 different mindsets. What's yours? http://nyl.co/1td9v1q","created_time":"2016-06-09T14:39:31+0000","id":"113373749451_10154249375449452"},{"message":"Dear New York Life,\nI would like to thank you for collecting my insurance premiums for the last 18 years without fail, then sending me a letter that there were not enough funds in the account to sustain the automatic withdrawal for those same premiums. When I called to find out what happened to my money you could not answer my questions but agreed to send the itemized statement that I requested for my account. This was a week ago, and I was told the cash value was $200.00. After 18 years. I could have thrown my money out my front window an gotten a better return, as at least some of it would have stuck to my lawn. As I am trying to figure out the foreign language of insurance in all the paperwork you have sent me, today you sent another letter stating you cancelled my policy and there is no insurance or cash value. Thank you for siphoning off the last $200.00 of my policy. My agent does not ever answer his phone. Your latest letter says to call the customer service number with questions, but goes directly to an automated system. We will talk again New York Life, but this time I will have legal representation.","created_time":"2016-06-09T14:14:00+0000","id":"113373749451_10154249318344452"},{"message":"When is the best time to discuss financial matters with your family? How about now?","created_time":"2016-06-08T13:30:08+0000","id":"113373749451_10154246410424452"},{"message":"It's #TwitterTuesday here at Small Business Expo! Join us on the Twittersphere to meet your New York Exhibitors. Use the hashtag #SmallBizExpo to join us!\n\n1-888-GO-ANSWER!, 2Growit4ward Foundation, 7-Eleven, Accion East,ABFFAB Business Development, ACE Innovative Networks, ADT, Adverator, AFCEA, Amigo/DMS, AP Lazer, AT&T Small Business, Bank of America, Barnum Financial Group, An Office of MetLife, Beautiful Teddy Bears, Benchmark, Berkman Financial, BizFilings, BizTalkRadio, Black011 Pinless, BNI Chapter 23 - Grand Central Powerhouse, Brooklyn Whatever, Business Credit Blueprint, Business Flipping Mastery, CAN Capital, Captivate, CATS Technology Solutions Group, Chinamerica Radio, COBRND, Comcast Spotlight, CompanyPlus, Concur, ConEdison Solutions, Cricket Wireless, CrowdAdvance, Custom Candle Co, Custom Toll Free, CXO Crew, Exceptional Tech Support, Daily News Digital Solutions, Dobson Communications, DocuSign, doForms, Dun & Bradstreet, DurAmerica Brokerage Inc, DYNALINK COMMUNICATIONS, Dynamic Document Services, Emerge212, Empire Cruises, Empire State Development, Excelsior Growth Fund, Express Employment Professionals, Express Trade Capital, eyn products, Factor King, Fairfax Data Systems, Inc., Fidelity Payment Service, Fisher Investments, FlipYour.website, Fora Financial, Franchise Creator, Freedom Mortgage, Gartner, Geeks & Suits, General Assembly, Great Agency Inc - Insurance & Risk Management, Greenwich Village Chelsea Chamber of Commerce, Greg Martin: Photography, Grid Be Gone LLC, HECS Solutions, Inc., Heritage Chimney Service, Innovatix, International Planning Alliance, LLC, Itemize, KAFE Digital Marketing, Klust Creative, Lacia Design, Laundrylux, Leading Edge Administrators, Life Planning Group, Martha Lynn Laskie Graphic Design & Illustration, Medieval Times Dinner & Tournament, Midtown Office Supplies, Misaic, Mook Print & Design, Morgan Funding Partners, Margins Plus Software, Mythic VR, Bouler Pfluger Architects, P.C., NAWBO NYC, neopost, Network After Work - Networking Events for Professionals, New American Chamber of Commerce, New York City Bar Legal Referral Service, New York Life Insurance Company, New York Women's Chamber of Commerce, North American Bancard, NYC Department of Small Business Services, NYC LGBTQS Chamber of Commerce, NY State of Health, Oasis Outsourcing, New York City Health Insurance Link, OmniCall, Paychex, Pfizer, Powerteam Consulting, PowerteamUSA, Premier Trade Solutions, Primus Business Management, Progressive Commercial Auto Insurance, Prosper Digital, Protouch Solutions, LLC, QXD | Quality XP Development, Queens Chamber of Commerce, Ray Business Technologies Pvt Ltd, RCN, REDEEMAR, Regional Business Assistance Program, Richard Gilmartin CPA PC, Santander Bank US - Branch, Screenvision, Seek Capital, Servcorp NYC, Sheila Mac Consulting, Simplefy, Sky Technology Partners, Slemma, Social Joey, Socialfix Media, Sprint, Strategic Capital, Strategic Funding Source, Inc., Surgo Group, Swap The Biz, T-Mobile, TD, Tekie Geek, Texcido, The Management Academy, The Super Investment LLC, theNYnetwork, EBillity, Time Warner Cable Business Class, Top Notch Cinema, U.S. Census Bureau, Unishippers, United Merchant Processing Association, Upper Cervical Chiropractic of NY, PC: Dr. George Gertner, US Postal Service, VEDC, Village Chiropractic, Vistaprint, VoIP Supply (www.VoIPSupply.com), Wells Fargo, Womeninbusiness.org, World Business Lenders, YP, Ziplocal and Zoro","created_time":"2016-06-07T15:59:15+0000","id":"113373749451_10154244031494452"},{"message":"Protecting your spouse is simple. You just have to have a plan in place. #Pride #FactsOfLifeInsurance","created_time":"2016-06-07T13:46:48+0000","id":"113373749451_10154243727569452"},{"message":"Get Approval in as Little as 60 seconds For The #PrepaidVisa Card with BBVA. Their offer is valid nationwide. $0 Monthly or Annual Fee/ Reload Fees/ Purchase Transaction Fees. No credit check to apply. Apply Now! ","created_time":"2016-06-06T22:56:10+0000","id":"113373749451_1726167590941505"},{"message":"What makes you most proud of your heritage?\n#CaribbeanAmericanHeritageMonth","created_time":"2016-06-06T13:23:47+0000","id":"113373749451_10154241115929452"},{"message":"New York Life Insurance Company made free IDs for children","story":"Sparkle City Rhythm & Ribs at Sparkle City Rhythm & Ribs.","created_time":"2016-06-06T00:01:03+0000","id":"113373749451_10154239957464452"}],"paging":{"previous":"https://graph.facebook.com/v2.6/113373749451/feed?since=1466009217&access_token=EAAY1cLe9UC8BAOIY60ijJawISs5Yz4oZCpnffRTZCXNNpS8a7NZBW6XZAQNxQS5eYqfjFfi0asxP8D0whDK4qC2rHfSuUkfy4PCg2LXz0ZCg95HcOdlaVZBWYXFrGfu5f5tgjwXZCVts01zvuP4TcTEOTSgPhGuhetC7olhMc8f4QZDZD&limit=25&__paging_token=enc_AdCWGKqEJRQ98heOZBQ4LwDV6TDDlvlUoBPQbBLJAzp8ZA5LQOg4WreKvEGRz6t5ZAiOWsR4A3xttcrNKrZBAhN6sTCB6JXSjqfqLZAbKtQiisjrotgZDZD&__previous=1","next":"https://graph.facebook.com/v2.6/113373749451/feed?access_token=EAAY1cLe9UC8BAOIY60ijJawISs5Yz4oZCpnffRTZCXNNpS8a7NZBW6XZAQNxQS5eYqfjFfi0asxP8D0whDK4qC2rHfSuUkfy4PCg2LXz0ZCg95HcOdlaVZBWYXFrGfu5f5tgjwXZCVts01zvuP4TcTEOTSgPhGuhetC7olhMc8f4QZDZD&limit=25&until=1465171263&__paging_token=enc_AdBWA0uNAcDYdnm66sxToAKxZBRWnJXKEnaLmX4Oeigh14vA0F3jHDviWZBNZBmm8wLpSqfJtC2mFZCViGm53C2KX7uA5t86TEUVyMw1P0dLZC2iVgwZDZD"}}