{
    "data": [
        {
            "id": "113373749451_10154268244429452",
            "status_type": "shared_story",
            "message": "Let's talk about POP (and we don't mean your dad).",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-16T14:32:46+0000"
        },
        {
            "id": "113373749451_10154266359584452",
            "status_type": "shared_story",
            "message": "“The Other Supreme Court: The 2016 New York Life Insurance Company ACC Tournament”, set to air on ESPNU, documents this past year’s Washington, D.C. experience. Read more: http://theacc.co/mbb16documentary",
            "from": {
                "name": "Atlantic Coast Conference",
                "id": "54058402222"
            },
            "created_time": "2016-06-15T20:29:45+0000"
        },
        {
            "id": "113373749451_10208698153963623",
            "status_type": "added_photos",
            "message": "Arizona History . . . look at the building in the background.   100 years ago, just 4 years after we became a State.",
            "from": {
                "name": "Bruce Usher",
                "id": "10204705776036670"
            },
            "created_time": "2016-06-15T16:46:57+0000"
        },
        {
            "id": "113373749451_10154265786834452",
            "status_type": "shared_story",
            "message": "Women influence 67% of household investment decisions. So how can they secure their financial future as well?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-15T15:57:07+0000"
        },
        {
            "id": "113373749451_10154262720154452",
            "status_type": "mobile_status_update",
            "message": "We are deeply saddened by the unimaginable act of violence in Orlando. Our thoughts are with the victims and their families. Around the world, NYL is #OrlandoUnited.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-14T11:41:36+0000"
        },
        {
            "id": "113373749451_10154261728654452",
            "status_type": "wall_post",
            "message": "One of your sales associates interrupted my dinner this evening. She came to the door of my home and when my husband and I tried to politely decline, she persisted. We didn't reply to your bombardment of mailers, so we're clearly not interested in your services. Sending someone to my home during dinner time is certainly not going to win my business.",
            "from": {
                "name": "Alyson Herndon",
                "id": "2200231921724"
            },
            "created_time": "2016-06-13T23:39:59+0000"
        },
        {
            "id": "113373749451_10154261374429452",
            "status_type": "added_photos",
            "message": "Volunteers from New York Life Insurance Company were at Fernside Friday afternoon doing a lot of GOOD for Fernside! Thanks to all the New York Life staffers who took time out of their busy day to support the grieving children and families in Cincinnati!",
            "from": {
                "name": "Fernside: A Center for Grieving Children",
                "id": "263116619070"
            },
            "created_time": "2016-06-13T20:58:18+0000"
        },
        {
            "id": "113373749451_10154261342944452",
            "status_type": "added_photos",
            "message": "Part of what makes Camp Forget-Me-Not/Camp Erin DC truly special are the personalized touches our campers receive. From the interaction with their buddy to the smaller items that they can take home that remind them of their healing experience at camp. \n\nToday, New York Life Insurance Company employees, led by camp volunteer Dominique Duong, generously donated blankets and hand-made luggage tags to our campers. We are so grateful for their time and commitment to camp!",
            "from": {
                "name": "Wendt Center for Loss and Healing",
                "id": "438282009573658"
            },
            "created_time": "2016-06-13T20:44:38+0000"
        },
        {
            "id": "113373749451_10154261165389452",
            "status_type": "shared_story",
            "message": "Weigh in: Will Social Security be there for Millenials in the future?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-13T19:32:51+0000"
        },
        {
            "id": "113373749451_10154261125149452",
            "status_type": "added_photos",
            "message": "We welcome the new partnership with New York Life Las Vegas General Office, who assisted at Camp Erin Las Vegas with logistics and providing campers with snacks and sundries. They loved interacting with the campers and look forward to expanding the partnership in 2017! Thank you, New York Life Insurance Company! #NYLVolunteers",
            "from": {
                "name": "The Moyer Foundation",
                "id": "107886994702"
            },
            "created_time": "2016-06-13T19:11:42+0000"
        },
        {
            "id": "113373749451_10154260936339452",
            "status_type": "added_photos",
            "message": "Another amazing day at New York Life Insurance Company! We made SoaringDreamCatchers for hospitalized children to inspire them to “dream big!” Thank you to our fantastic team-leads: Alexandra Capodieci, Jeanette Liberto\nand Allison Klasson!",
            "from": {
                "name": "Soaringwords",
                "id": "283908761647305"
            },
            "created_time": "2016-06-13T17:46:41+0000"
        },
        {
            "id": "113373749451_10154252633139452",
            "status_type": "added_photos",
            "message": "Team New York Life Insurance Company",
            "from": {
                "name": "Mid-Maine Chamber of Commerce",
                "id": "40542473018"
            },
            "created_time": "2016-06-10T17:15:35+0000"
        },
        {
            "id": "113373749451_10153548744072797",
            "status_type": "added_photos",
            "message": "SCAM ALERT! Is there an email address I can forward these emails to so that your security team can investigate?",
            "from": {
                "name": "Kristen Go",
                "id": "10152467285672797"
            },
            "created_time": "2016-06-10T16:25:54+0000"
        },
        {
            "id": "113373749451_10154252223654452",
            "status_type": "wall_post",
            "message": "New York Life is not the company you keep, it is THE COMAPNY THAT KEEPS YOUR MONEY!",
            "from": {
                "name": "Jackie Johnson VanNorman",
                "id": "10203155591472554"
            },
            "created_time": "2016-06-10T14:01:54+0000"
        },
        {
            "id": "113373749451_10154252218754452",
            "status_type": "shared_story",
            "message": "Dad always says: The best things in life are free (and handmade!). #FathersDay",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-10T14:00:15+0000"
        },
        {
            "id": "113373749451_10154252192559452",
            "status_type": "added_photos",
            "message": "New York Life Insurance Company Erin Furman",
            "from": {
                "name": "LGBTea Dances",
                "id": "1382228708767767"
            },
            "created_time": "2016-06-10T13:45:44+0000"
        },
        {
            "id": "113373749451_10154250636309452",
            "status_type": "wall_post",
            "message": "If the insured dies, will the beneficiaries receive both the Death Benefit of the Whole Life Policy and the Cash Surrender Value (CSV)?",
            "from": {
                "name": "Veronica Johns",
                "id": "146063435811262"
            },
            "created_time": "2016-06-09T23:40:02+0000"
        },
        {
            "id": "113373749451_10154250113389452",
            "status_type": "shared_story",
            "message": "Why are we the top mutual insurer? #Fortune500",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-09T20:19:42+0000"
        },
        {
            "id": "113373749451_10154250091624452",
            "status_type": "shared_story",
            "message": "Why are we the top mutual insurer? #Fortune500",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-09T20:12:28+0000"
        },
        {
            "id": "113373749451_10154249375449452",
            "status_type": "shared_story",
            "message": "When it comes to retirement planning, people often have 3 different mindsets. What's yours? http://nyl.co/1td9v1q",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-09T14:39:31+0000"
        },
        {
            "id": "113373749451_10154249318344452",
            "status_type": "wall_post",
            "message": "Dear New York Life,\nI would like to thank you for collecting my insurance premiums for the last 18 years without fail, then sending me a letter that there were not enough funds in the account to sustain the automatic withdrawal for those same premiums. When I called to find out what happened to my money you could not answer my questions but agreed to send the itemized statement that I requested for my account. This was a week ago, and I was told the cash value was $200.00. After 18 years. I could have thrown my money out my front window an gotten a better return, as at least some of it would have stuck to my lawn. As I am trying to figure out the foreign language of insurance in all the paperwork you have sent me, today you sent another letter stating you cancelled my policy and there is no insurance or cash value. Thank you for siphoning off the last $200.00 of my policy. My agent does not ever answer his phone. Your latest letter says to call the customer service number with questions, but goes directly to an automated system. We will talk again New York Life, but this time I will have legal representation.",
            "from": {
                "name": "Jackie Johnson VanNorman",
                "id": "10203155591472554"
            },
            "created_time": "2016-06-09T14:14:00+0000"
        },
        {
            "id": "113373749451_10154246410424452",
            "status_type": "shared_story",
            "message": "When is the best time to discuss financial matters with your family? How about now?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-08T13:30:08+0000"
        },
        {
            "id": "113373749451_10154244031494452",
            "status_type": "shared_story",
            "message": "It's #TwitterTuesday here at Small Business Expo! Join us on the Twittersphere to meet your New York Exhibitors. Use the hashtag #SmallBizExpo to join us!\n\n1-888-GO-ANSWER!, 2Growit4ward Foundation, 7-Eleven, Accion East,ABFFAB Business Development, ACE Innovative Networks, ADT, Adverator, AFCEA, Amigo/DMS, AP Lazer, AT&T Small Business, Bank of America, Barnum Financial Group, An Office of MetLife, Beautiful Teddy Bears, Benchmark, Berkman Financial, BizFilings, BizTalkRadio, Black011 Pinless, BNI Chapter 23 - Grand Central Powerhouse, Brooklyn Whatever, Business Credit Blueprint, Business Flipping Mastery, CAN Capital, Captivate, CATS Technology Solutions Group, Chinamerica Radio, COBRND, Comcast Spotlight, CompanyPlus, Concur, ConEdison Solutions, Cricket Wireless, CrowdAdvance, Custom Candle Co, Custom Toll Free, CXO Crew, Exceptional Tech Support, Daily News Digital Solutions, Dobson Communications, DocuSign, doForms, Dun & Bradstreet, DurAmerica Brokerage Inc, DYNALINK COMMUNICATIONS, Dynamic Document Services, Emerge212, Empire Cruises, Empire State Development, Excelsior Growth Fund, Express Employment Professionals, Express Trade Capital, eyn products, Factor King, Fairfax Data Systems, Inc., Fidelity Payment Service, Fisher Investments, FlipYour.website, Fora Financial, Franchise Creator, Freedom Mortgage, Gartner, Geeks & Suits, General Assembly, Great Agency Inc - Insurance & Risk Management, Greenwich Village Chelsea Chamber of Commerce, Greg Martin: Photography, Grid Be Gone LLC, HECS Solutions, Inc., Heritage Chimney Service, Innovatix, International Planning Alliance, LLC, Itemize, KAFE Digital Marketing, Klust Creative, Lacia Design, Laundrylux, Leading Edge Administrators, Life Planning Group, Martha Lynn Laskie Graphic Design & Illustration, Medieval Times Dinner & Tournament, Midtown Office Supplies, Misaic, Mook Print & Design, Morgan Funding Partners, Margins Plus Software, Mythic VR, Bouler Pfluger Architects, P.C., NAWBO NYC, neopost, Network After Work - Networking Events for Professionals, New American Chamber of Commerce, New York City Bar Legal Referral Service, New York Life Insurance Company, New York Women's Chamber of Commerce, North American Bancard, NYC Department of Small Business Services, NYC LGBTQS Chamber of Commerce, NY State of Health, Oasis Outsourcing, New York City Health Insurance Link, OmniCall, Paychex, Pfizer, Powerteam Consulting, PowerteamUSA, Premier Trade Solutions, Primus Business Management, Progressive Commercial Auto Insurance, Prosper Digital, Protouch Solutions, LLC, QXD | Quality XP Development, Queens Chamber of Commerce, Ray Business Technologies Pvt Ltd, RCN, REDEEMAR, Regional Business Assistance Program, Richard Gilmartin CPA PC, Santander Bank US - Branch, Screenvision, Seek Capital, Servcorp NYC, Sheila Mac Consulting, Simplefy, Sky Technology Partners, Slemma, Social Joey, Socialfix Media, Sprint, Strategic Capital, Strategic Funding Source, Inc., Surgo Group, Swap The Biz, T-Mobile, TD, Tekie Geek, Texcido, The Management Academy, The Super Investment LLC, theNYnetwork, EBillity, Time Warner Cable Business Class, Top Notch Cinema, U.S. Census Bureau, Unishippers, United Merchant Processing Association, Upper Cervical Chiropractic of NY, PC: Dr. George Gertner, US Postal Service, VEDC, Village Chiropractic, Vistaprint, VoIP Supply (www.VoIPSupply.com), Wells Fargo, Womeninbusiness.org, World Business Lenders, YP, Ziplocal and Zoro",
            "from": {
                "name": "Small Business Expo",
                "id": "197904033568361"
            },
            "created_time": "2016-06-07T15:59:15+0000"
        },
        {
            "id": "113373749451_10154243727569452",
            "status_type": "shared_story",
            "message": "Protecting your spouse is simple. You just have to have a plan in place. #Pride #FactsOfLifeInsurance",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-07T13:46:48+0000"
        },
        {
            "id": "113373749451_1726167590941505",
            "status_type": "shared_story",
            "message": "Get Approval in as Little as 60 seconds For The #PrepaidVisa Card with BBVA. Their offer is valid nationwide. $0 Monthly or Annual Fee/ Reload Fees/ Purchase Transaction Fees. No credit check to apply. Apply Now! ",
            "from": {
                "name": "Kimberly Ali",
                "id": "1726369764254621"
            },
            "created_time": "2016-06-06T22:56:10+0000"
        },
        {
            "id": "113373749451_10154241115929452",
            "status_type": "shared_story",
            "message": "What makes you most proud of your heritage?\n#CaribbeanAmericanHeritageMonth",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-06T13:23:47+0000"
        },
        {
            "id": "113373749451_10154239957464452",
            "status_type": "added_photos",
            "message": "New York Life Insurance Company made free IDs for children",
            "from": {
                "name": "Sparkle City Rhythm & Ribs",
                "id": "453208941552088"
            },
            "created_time": "2016-06-06T00:01:03+0000"
        },
        {
            "id": "113373749451_10154234021734452",
            "status_type": "shared_story",
            "message": "WATCH THIS! Jillian Michaels, Lisa Joyner, Jon Cryer, Judy Reyes, & Alec Mapa speak out at RaiseAChild.US #HONORS 2016 in support of foster children. #LetLoveDefineFamily®\nOur thanks also to: CBS, HBO, Penny Lane Centers, Foster Care and Adoption Recruitment - LA County, Five Acres Foster Care & Adoptions, Bienvenidos Children's Center, New York Life Insurance Company, Adoptions and Foster Care at Vista Del Mar, Children's Bureau, Extraordinary Families, Kidsave International, The Village Family Services, Westside Children's Center, Gay Parent Magazine, Mauro's Cafe at Fred Segal, Black Market Liquor Bar, Charmean Neithart Interiors, Elsie Green House and Home, Vaughan Benz, True Public Relations, LAcarGUY, Toyota of Hollywood, HuffPost Queer Voices, Andaz West Hollywood, Andaz Napa, Andrew Manning, Canali, Charlie's Custom Tours Puerto Rico, The Cheesecake Factory, Flappers Comedy Club Burbank, Foxy and Fierce Women's Kickboxing Bootcamp, Fresh Brothers, Halper Fine Art, Hästens,  Caribe Hilton, Hilton Imperial Dubrovnik, Hornblower Cruises & Events San Diego, Hotel del Coronado, iHeartRadio, iPic Pasadena, KidsEmbrace, KPL Select Mortgage, Inc., KTLA 5 News, KTLA 5 Morning News, LACMA Los Angeles County Museum of Art, Lafayette 148 New York, Landry's Seafood, Let's Party L.A. Entertainment, London Duck Tours, Madame Tussauds Hollywood, Madonna Inn, Mammoth Mountain, Martin Lawrence Galleries, MLB Network, MOCA | The Museum of Contemporary Art, Los Angeles, Moonlight Stage Productions, Muscle Mechanics, Natural History Museum of Los Angeles County, Palm Springs Aerial Tramway, Park Plaza Westminster Bridge Hotel, Ralphs, Salon True, Samuelsohn, San Diego Marriott Del Mar, San Diego Zoo, Saxony Design Build Inc., Shepard Fairey, Kai Loebach, Southwest Airlines, Sports Authority, TailorByrd, Telepictures Productions, Ellen DeGeneres, The Cosmopolitan of Las Vegas, The Face Bar, the tasting kitchen, Disney, Tot Squad Los Angeles, Total Wine & More, Trader Joes Fan, The Westin Monache Resort, Mammoth, White House | Black Market, Whole Foods Market, EDGY Conference, Work The Room, John Gile, The Jim Henson Company, and our honorees Kimberly Cornell, Dana Foster & Gina Bar-ster, Jillian Michaels & Heidi Rhoades!  Hope you will plane to attend RaiseAChild HONORS 2017 next spring!",
            "from": {
                "name": "RaiseAChild.US",
                "id": "475208192502034"
            },
            "created_time": "2016-06-03T16:06:31+0000"
        },
        {
            "id": "113373749451_10154233791724452",
            "status_type": "shared_story",
            "message": "Fact: You don't have to own an estate to create an estate plan: http://nyl.co/1t6gQ3n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-03T14:10:37+0000"
        },
        {
            "id": "113373749451_10154232155214452",
            "status_type": "added_photos",
            "message": "Warm weather, good friends, and exercising for a good cause? Sign us up! Big thanks to all who participated in the #jpmcc yesterday!",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-02T20:04:39+0000"
        },
        {
            "id": "113373749451_10154231795844452",
            "status_type": "mobile_status_update",
            "message": "Keeping kids safe at the Cree Cruise is a top priority. Thank you New York Life Insurance Company for your help this Saturday and every day by handing out child fingerprinting packets!",
            "from": {
                "name": "Cree Cruise",
                "id": "462080210513744"
            },
            "created_time": "2016-06-02T16:36:42+0000"
        },
        {
            "id": "113373749451_10154231778594452",
            "status_type": "shared_story",
            "message": "There's something for everyone at Small Business Expo—New York! Meet the exhibitors offering their products and services to help your business grow:\n\n1-888-GO-ANSWER!, 2Growit4ward Foundation, 7-Eleven, Accion East, ABFFAB Business Development, ACE Innovative Networks, ADT, Adverator, AFCEA, Amigo/DMS, AP Lazer, AT&T Small Business, Bank of America, Barnum Financial Group, An Office of MetLife, Beautiful Teddy Bears, Benchmark, Berkman Financial, BizFilings, BizTalkRadio, Black011 Pinless, BNI Chapter 23 - Grand Central Powerhouse, Brooklyn Whatever, Business Credit Blueprint, Business Flipping Mastery, CAN Capital, Captivate, CATS Technology Solutions Group, Chinamerica Radio, COBRND, Comcast Spotlight, CompanyPlus, Concur, ConEdison Solutions, Cricket Wireless, CrowdAdvance, Custom Candle Co, Custom Toll Free, CXO Crew, Exceptional Tech Support, Daily News Digital Solutions, Dobson Communications, DocuSign, doForms, Dun & Bradstreet, DurAmerica Brokerage Inc, Dynalink Communications, Dynamic Document Services, Emerge212, Empire Cruises, Empire State Development, Excelsior Growth Fund, Express Employment Professionals Franchising, Express Trade Capital, eyn products, Factor King, Fairfax Data Systems, Inc., Fidelity Payment Services, Fisher Investments 401k Solutions, FlipYour.website, Fora Financial, Franchise Creator, Freedom Mortgage, Gartner, Geeks & Suits, General Assembly, Great Agency Inc - Insurance & Risk Management, Greenwich Village Chelsea Chamber of Commerce, Greg Martin Photography, Grid Be Gone LLC, HECS Solutions, Inc., Heritage Chimney Service Inc, Hiscox Small Business Insurance, HP Business, Hydromer Inc, Innovatix, International Planning Alliance, LLC, Itemize, KAFE Digital Marketing, Klust Creative, Lacia Design, Laundrylux, Leading Edge Administrators, Life Planning Group, Martha Lynn Laskie Graphic Design & Illustration, Medieval Times Dinner & Tournament - New Jersey, Midtown Office Supplies, Misaic, Mook Print & Design, Morgan Funding Partners, Margins Plus Software, Mythic VR, Bouler Pfluger Architects, P.C., NAWBO NYC, neopost, Network After Work - Networking Events for Professionals, New American Chamber of Commerce, New York City Bar Legal Referral Service, New York Life Insurance Company, New York Women's Chamber of Commerce, North American Bancard, NYC Department of Small Business Services, NYC LGBTQS Chamber of Commerce, NY State of Health, Oasis Outsourcing, New York City Health Insurance Link, OmniCall, Paychex, Pfizer, Powerteam Consulting, PowerteamUSA, Premier Trade Solutions, Primus Business Management, Progressive Commercial Auto Insurance, Prosper Digital, Protouch Solutions, LLC, QXD | Quality XP Development, Queens Chamber of Commerce, Ray Business Technologies Pvt Ltd, RCN, REDEEMAR, Regional Business Assistance Program, Richard Gilmartin CPA PC, Santander Bank US - ATM, Screenvision, Seek Capital, Servcorp NYC, Sheila Mac Consulting, Simplefy, Sky Technology Partners, Slemma, Social Joey, Socialfix Media, Sprint, Strategic Capital, Strategic Funding Source, Inc., Surgo Group, Swap The Biz, T-Mobile, TD, Tekie Geek, Texcido, The Management Academy, The Super Investment LLC, theNYnetwork, EBillity, Time Warner Cable Business Class, Top Notch Cinema, U.S. Census Bureau, Unishippers, United Merchant Processing Association, Upper Cervical Chiropractic of NY, PC: Dr. George Gertner, US Postal Service, VEDC, Village Chiropractic, Vistaprint, VoIP Supply (www.VoIPSupply.com), Wells Fargo, Womeninbusiness.org, World Business Lenders, YP, ZipLocal and Zoro.",
            "from": {
                "name": "Small Business Expo",
                "id": "197904033568361"
            },
            "created_time": "2016-06-02T16:31:21+0000"
        },
        {
            "id": "113373749451_10154231480109452",
            "status_type": "shared_story",
            "message": "77% of people are in danger of spending too much of their retirement savings. Are you one of them? http://nyl.co/1t3EDRx",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-02T13:34:24+0000"
        },
        {
            "id": "113373749451_10154230459314452",
            "status_type": "wall_post",
            "message": "Just saw your latest commercial....not a single family of color....not one...Why not?",
            "from": {
                "name": "Sondi Henry",
                "id": "10204552448915836"
            },
            "created_time": "2016-06-02T01:33:20+0000"
        },
        {
            "id": "113373749451_10154229355734452",
            "status_type": "shared_story",
            "message": "Meet miracle maker Bill Hagerty. By day, Bill helps individuals plan their futures through his work as a financial adviser with New York Life Insurance Company. In his spare time, he helps children and families at UC Davis Children's Hospital have a healthy and bright future through his volunteer work with Children's Miracle Network Hospitals.\n\nhttp://bit.ly/1RN6Y2p",
            "from": {
                "name": "Children's Miracle Network Hospitals at UC Davis",
                "id": "424443997664366"
            },
            "created_time": "2016-06-01T15:16:43+0000"
        },
        {
            "id": "113373749451_10154229289674452",
            "status_type": "shared_story",
            "message": "53% of people in the #LGBT community have questions about finances for same-sex couples. We're here to help. #Pride",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-06-01T14:44:41+0000"
        },
        {
            "id": "113373749451_10154228120334452",
            "status_type": "wall_post",
            "message": "I had contacted you guys about cancelling my policy through the phone and mail. And earlier this month I came on here to complain that it hadn't been cancelled, because I wasn't getting through otherwise. I thought it was taken care of based on the phone response I had and email from your social media account. But AGAIN I'm being charged for the policy that was supposed to be cancelled months ago. For the fifth time, cancel my policy and refund my money.",
            "from": {
                "name": "Chris Diba",
                "id": "10104645892770541"
            },
            "created_time": "2016-06-01T02:13:57+0000"
        },
        {
            "id": "113373749451_10154227522549452",
            "status_type": "shared_story",
            "message": "Ready to ace #CollegeSavings 101?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-31T19:26:01+0000"
        },
        {
            "id": "113373749451_10154227068944452",
            "status_type": "shared_story",
            "message": "If you haven't had a chance to see our latest edition, check out Ted Mathas, CEO of New York Life Insurance Company. http://www.latinoleaders.com/Magazine/Issue-Archive/",
            "from": {
                "name": "Latino Leaders Magazine",
                "id": "173486429840"
            },
            "created_time": "2016-05-31T15:06:56+0000"
        },
        {
            "id": "113373749451_10154226018669452",
            "status_type": "shared_story",
            "message": "This Memorial Day weekend, our Foundation was proud to offer support to Tragedy Assistance Program for Survivors (TAPS) as families stand together to remember their loved ones. Who will you honor? #GratefulNation\nwww.taps.org",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-31T03:28:34+0000"
        },
        {
            "id": "113373749451_10154225714359452",
            "status_type": "wall_post",
            "message": "I have 100,000.00 in life insurance, please verify",
            "from": {
                "name": "Bonnie Wake",
                "id": "1579056482327901"
            },
            "created_time": "2016-05-30T23:39:03+0000"
        },
        {
            "id": "113373749451_10154230655594452",
            "status_type": "added_photos",
            "message": "New York Life Insurance Company at Multicultural Family Festival 2016\n\nPhoto Credit: Eugene Panchenko\n#FamilyFest #FunForTheWholeFamily by #CouncilForCrossCulturalAffair",
            "from": {
                "name": "RAM | Russian American Media",
                "id": "171076732902456"
            },
            "created_time": "2016-05-30T01:30:19+0000"
        },
        {
            "id": "113373749451_244572679253007",
            "status_type": "added_photos",
            "message": "a verry good insurance",
            "from": {
                "name": "Javier Arroyo",
                "id": "162158884161054"
            },
            "created_time": "2016-05-29T22:52:19+0000"
        },
        {
            "id": "113373749451_10154218282534452",
            "status_type": "added_photos",
            "message": "Chamber members Dunkin' Donuts, Banner Ford, and Michael Mire with New York Life Insurance Company",
            "from": {
                "name": "St. Tammany West Chamber",
                "id": "88033907886"
            },
            "created_time": "2016-05-27T21:02:09+0000"
        },
        {
            "id": "113373749451_10154217996654452",
            "status_type": "added_photos",
            "message": "Today we gave thanks to the ones who gave their all #MemorialDay",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-27T18:42:20+0000"
        },
        {
            "id": "113373749451_10154217480904452",
            "status_type": "shared_story",
            "message": "Think you know how much retirement income your savings can generate? http://nyl.co/1ORwiV4",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-27T14:01:19+0000"
        },
        {
            "id": "113373749451_10154215477974452",
            "status_type": "shared_story",
            "message": "Join any time between now and 2 p.m. to chat 1:1 with recruiters from Kronos, Berry Plastics, Philips, Wittmann Battenfeld, Entegee and New York Life Insurance Company!",
            "from": {
                "name": "UMass Lowell Alumni",
                "id": "61402692126"
            },
            "created_time": "2016-05-26T16:06:59+0000"
        },
        {
            "id": "113373749451_10154215209229452",
            "status_type": "shared_story",
            "message": "Can one policy cover your whole family? Now that's smart. http://nyl.co/1OPd7LK\r #FactsOfLifeInsurance",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-26T13:27:09+0000"
        },
        {
            "id": "113373749451_10154213334619452",
            "status_type": "shared_story",
            "message": "Tell us: What makes you proud of your heritage?\r #APAHM2016",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-25T15:31:55+0000"
        },
        {
            "id": "113373749451_10154211649609452",
            "status_type": "shared_story",
            "message": "1 in 20 Americans will lose a parent before age 16 & the majority of children will experience the loss of a family member or friend by the time they complete high school. With the help of a grant from our Foundation, UTHealth, Houston is working to improve the way that grieving children are assessed and supported.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-24T20:50:59+0000"
        },
        {
            "id": "113373749451_10154211214314452",
            "status_type": "wall_post",
            "message": "Yeah I was hoping to take out a policy on a death row inmate? Anyone able to help me with this?",
            "from": {
                "name": "John Matthews",
                "id": "507446422695081"
            },
            "created_time": "2016-05-24T17:12:53+0000"
        },
        {
            "id": "113373749451_10154211181679452",
            "status_type": "shared_story",
            "message": "Aaron Kwittken sat down with SVP and Chief Communications & Marketing Officer of New York Life Insurance Company, Kelli Parsons, to discuss how the company is taking an integrated approach to cater to \"maturing millennials.\"",
            "from": {
                "name": "Kwittken",
                "id": "81581153755"
            },
            "created_time": "2016-05-24T17:05:08+0000"
        },
        {
            "id": "113373749451_10154210748334452",
            "status_type": "shared_story",
            "message": "Is there a program that's made a big difference in your community? #AfterSchoolAllStars",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-24T13:33:11+0000"
        },
        {
            "id": "113373749451_10154208873209452",
            "status_type": "shared_story",
            "message": "We had a blast with the After-School All-Stars team on Friday! Learn about the positive impact they’re making in Tampa Bay & beyond.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-23T17:54:45+0000"
        },
        {
            "id": "113373749451_10154208537514452",
            "status_type": "shared_story",
            "message": "We're almost at the halfway mark of 2016. Is it time you reevaluated your financial resolutions? http://nyl.co/1OIXZj0",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-23T14:55:02+0000"
        },
        {
            "id": "113373749451_10154208044414452",
            "status_type": "added_photos",
            "message": "Last week Ed Fleming did a 10 minute presentation on utilizing a group health insurance captive or a MEWA.  Shepherd Insurance Partners works with both of these programs and they can be a great way to provide a substantial savings for employers struggling with rising premiums related to their group health insurance plan.\n\nAlso presenting was Julie Damopoulos with New York Life Insurance Company.  Julie discussed various life insurance strategies.  Julie also provided great insight as to when parents should open a college savings account for their children.  \n\nThe Phoenix Chapter of AmSpirit Business Connections meets at Harrison College  located just off 71 South and Stringtown Road every Friday at 9:30.  If you own a business or in sales and are not a member of AmSpirit Business Connections you are missing out on a great opportunity to build your business.  Give Shepherd Insurance Partners a call to find out how AmSpirit can grow your business!",
            "from": {
                "name": "Shepherd Insurance Partners, Inc.",
                "id": "452799374873432"
            },
            "created_time": "2016-05-23T09:47:21+0000"
        },
        {
            "id": "113373749451_10210150344703533",
            "status_type": "added_photos",
            "from": {
                "name": "Ken Pearson",
                "id": "10205966201182560"
            },
            "created_time": "2016-05-22T11:36:50+0000"
        },
        {
            "id": "113373749451_10154205232454452",
            "status_type": "wall_post",
            "message": "I wonder sometimes how the insurance industry got so messed up? How can it be that I can't see a doctor for an issue if my insurance company doesn't deem it worthy? Their doctor, who has never seen me, says I'm fine and I don't need that test. Won't is face be red when I die in six months! And why do I have to pay 30% of my income for insurance? They need all that money not for claims, oh no, they need it to run more commercials. Their commercials are everywhere and it drives me nuts. My premiums could be cut in have if the insurance company cut half its advertising budget. Do know it estimated that health insurance companies spent more then $500 million dollars last year to fight each other with ads. I have to spend $800 a month for my family and can't get a - See more at: http://www.myrantspace.com/insurance-companies-must-go/#sthash.nQxwT3EJ.dpuf",
            "from": {
                "name": "My Rant Space",
                "id": "104797989852526"
            },
            "created_time": "2016-05-22T05:08:39+0000"
        },
        {
            "id": "113373749451_10154205020179452",
            "status_type": "wall_post",
            "message": "Hello everybody here",
            "from": {
                "name": "Jennifer Ojo",
                "id": "134735310192079"
            },
            "created_time": "2016-05-22T02:19:07+0000"
        },
        {
            "id": "113373749451_239551856413802",
            "status_type": "shared_story",
            "message": "Sometimes you just need to remove yourself from the rat race ....\n\nI did.  Can I help you too?\n\nhttps://www.facebook.com/Sun-Country-House-in-Spain-200917316967873/\n\nCheck out these fabulous investments in your dream home in Spain.\nWe have property available from 10,000 euros.   Over 30 properties under £39,000 and over 1000 to over £3,000,000. \nProperties are in Costa Blanca the year round 20 degree sunshine region of Spain.  Within an area from coast to inland, from Benidorm to Pillar de la Horarada.\nWhether you are looking for a studio to an 8 bed house, for that investment opportunity or dream home, we have everything you could need.   \nProperty prices are the best they have been, so now’s the time to go for it!  Check out our Facebook page.\nwww.suncountryhouseinspain.com    email:  donnasuncountryhouseinspain.com",
            "from": {
                "name": "Donna Gormer",
                "id": "223860361316285"
            },
            "created_time": "2016-05-21T11:32:39+0000"
        },
        {
            "id": "113373749451_10154201233774452",
            "status_type": "shared_story",
            "message": "Whose dedication inspires you? http://bddy.me/1ODA44e\r #ArmedForcesDay",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-20T13:31:02+0000"
        },
        {
            "id": "113373749451_10154201197229452",
            "status_type": "added_photos",
            "message": "Looking for a career in finance? Meet face to face with representatives from New York Life Insurance Company at RecruitCT on June 10th in Trumbull. Register today! http://ow.ly/B2uQ300fZTr",
            "from": {
                "name": "RecruitCT",
                "id": "656719567771233"
            },
            "created_time": "2016-05-20T13:10:17+0000"
        },
        {
            "id": "113373749451_10154199750159452",
            "status_type": "added_photos",
            "message": "SoaringOrigami fun at New York Life Insurance Company! Ori meaning \"folding\", and kami meaning “paper” is the traditional Japanese art of paper folding. Today we made hundreds of SoaringOrigami for hospitalized children. Thank you to our fantastic team-leads: Kyle Eng, Judy Leung and Jessica Saavedra!!!",
            "from": {
                "name": "Soaringwords",
                "id": "283908761647305"
            },
            "created_time": "2016-05-19T20:47:35+0000"
        },
        {
            "id": "113373749451_10154199042104452",
            "status_type": "shared_story",
            "message": "How does diversity fuel ideas in your workplace? Our CEO, Ted Mathas, weighs in, in the most recent issue of Latino Leaders Magazine.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-19T14:52:55+0000"
        },
        {
            "id": "113373749451_10154197169499452",
            "status_type": "added_photos",
            "message": "We'd like to send a BIG THANK YOU to not only the 400 attendees who came out to today's Champions for Children Luncheon in Seattle, but to our dedicated sponsors New York Life Insurance Company, Brotherton Cadillac Buick GMC, Seattle Mariners, and all of our table sponsors for helping make the fun-filled, camp-inspired day possible! Because of them, 100% of the proceeds raised at the luncheon will benefit our mission to provide healing to children and families affected by grief and addiction. A special shoutout to our volunteers, emcee Steve Raible KIRO 7, as well as this year’s Champions for Children Award recipient Dr. Gary Gilliland! What a day!",
            "from": {
                "name": "The Moyer Foundation",
                "id": "107886994702"
            },
            "created_time": "2016-05-18T22:55:11+0000"
        },
        {
            "id": "113373749451_10154196943384452",
            "status_type": "shared_story",
            "message": "Congratulations, Dr. Julie Kaplow! This New York Life Insurance Company grant will expand the great work you are doing to help children learn to handle grief.",
            "from": {
                "name": "UTHealth Psychiatry",
                "id": "105380172832388"
            },
            "created_time": "2016-05-18T20:36:09+0000"
        },
        {
            "id": "113373749451_10154196472719452",
            "status_type": "shared_story",
            "message": "Retirement income isn’t one-size-fits-all. Find out how you can develop a retirement income plan based on your  needs.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-18T16:58:53+0000"
        },
        {
            "id": "113373749451_10154194909209452",
            "status_type": "shared_story",
            "message": "LUNCH & LEARN is tomorrow at the Kaiser Mall, 12-1pm. Learn more from New York Life Insurance Company about scaling from 1 to 100. Lunch is $5 per member, and provided by The Town Kitchen (usually a $13 lunch!). \nhttps://www.eventbrite.com/e/lunch-learn-scaling-from-1-to-100-financial-foundations-tickets-24664363776",
            "from": {
                "name": "The Port Workspaces",
                "id": "359993377407534"
            },
            "created_time": "2016-05-17T23:27:33+0000"
        },
        {
            "id": "113373749451_10154193937704452",
            "status_type": "shared_story",
            "message": "Thank you for everyone who participated & sponsored the Trunk Show Fundraiser - here's a recap of the events. Big thanks to all our sponsors and partners who are making this possible:Tom James Company Clayton on the Park, Cantina Laredo Clayton, Stl Motorcars, Purus Vodka , Cafe Napoli, Red Fitness Lounge, Stu Block, Claire Flowers, New York Life Insurance Company, The Tarlow Foundation Gershman Mortgage, The Kathy Helbig Group , Metabolic Meals,  Tesla, SLAM Agency, mascot agency, Stella & Dot,  & Baldwin Piano and Organ Center - Herrin, IL Enjoy! http://bit.ly/1Xizdgc",
            "from": {
                "name": "The St. Louis Suit Project",
                "id": "451988384841575"
            },
            "created_time": "2016-05-17T15:08:48+0000"
        },
        {
            "id": "113373749451_10154193910199452",
            "status_type": "shared_story",
            "message": "Did you know: You could accumulate cash value & get tax advantages from a permanent life insurance policy?\n#FactsOfLifeInsurance",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-17T14:56:17+0000"
        },
        {
            "id": "113373749451_1016433688451401",
            "status_type": "shared_story",
            "message": "I found a easy guide for life insurance, figured i'd share for others: ",
            "from": {
                "name": "John Phillips",
                "id": "1021034314658005"
            },
            "created_time": "2016-05-16T19:01:37+0000"
        },
        {
            "id": "113373749451_10154192134989452",
            "status_type": "shared_story",
            "message": "Thank you Mourning Hope Grief Center for hosting Jamie at your annual breakfast fundraiser last week! He enjoyed meeting your team and seeing all the inspiring ways you are supporting grieving children and families in your community. Huge thanks to the New York Life Insurance Company agents and #NYLVolunteers in Lincoln, NE who were also in attendance and do so much to support their local Camp Erin!",
            "from": {
                "name": "The Moyer Foundation",
                "id": "107886994702"
            },
            "created_time": "2016-05-16T18:44:25+0000"
        },
        {
            "id": "113373749451_10154190997479452",
            "status_type": "wall_post",
            "message": "Worked with Mary Brennan on some retirement investments. She saved me $114,000 in a single afternoon. I highly recommend using her for all your investment needs! Feel free to contact me if you would like more details.",
            "from": {
                "name": "Ratt Ratledge",
                "id": "10205194581519660"
            },
            "created_time": "2016-05-16T07:45:35+0000"
        },
        {
            "id": "113373749451_10153820615114118",
            "status_type": "added_photos",
            "message": "Ana and Elsa love New York Life! College funding done right! #momfesthattiesburg #newyorklife",
            "from": {
                "name": "Alicia Muncy Russell",
                "id": "10152382391024118"
            },
            "created_time": "2016-05-15T22:41:54+0000"
        },
        {
            "id": "113373749451_10154186405924452",
            "status_type": "wall_post",
            "message": "I'm on disability waiver with NY Life Insurance. Every year or so you require a form filled out from my doctor stating \"I'm still disabled\". For some unknown reason the USPS struggles to understand the difference between Lane, Avenue & Drive. So I requested the form to also be emailed to me to avoid USPS mis-deliveries & to bring NY Life into the 21st century. I was told \"no, the form isn't available in that format\" \nIt would be easier on all involved if you made the form available via email or from your website. Then you could just email me with a link \"its that time again\".\n😀\nJust a thought.",
            "from": {
                "name": "Shelley Morris Henson",
                "id": "10203802323240551"
            },
            "created_time": "2016-05-14T08:49:45+0000"
        },
        {
            "id": "113373749451_10154184455524452",
            "status_type": "added_photos",
            "message": "Not everyone thinks about retirement the same way. What are your thoughts?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-13T13:19:25+0000"
        },
        {
            "id": "113373749451_10154182277654452",
            "status_type": "shared_story",
            "message": "How do you determine how much coverage you need?#FactsOfLifeInsurance",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-12T15:22:23+0000"
        },
        {
            "id": "113373749451_10154180377389452",
            "status_type": "added_photos",
            "message": "Senate President John Alario, Chamber Chairman Bret Kolman, CEO of Lakeview Regional Medical Center, Rick Dennie of New York Life Insurance Company and Ray Seamon of First NBC Bank",
            "from": {
                "name": "St. Tammany West Chamber",
                "id": "88033907886"
            },
            "created_time": "2016-05-11T19:58:18+0000"
        },
        {
            "id": "113373749451_10154180055339452",
            "status_type": "shared_story",
            "message": "Great op-ed in cleveland.com from the Executive Director of our After-School All-Stars Ohio Cleveland chapter, talking about how our programs help close the opportunity gap in Northeast Ohio and how partners like the New York Life Insurance Company Foundation make our work possible. http://www.cleveland.com/opinion/index.ssf/2016/05/two_after-school_programs_in_c.html",
            "from": {
                "name": "After-School All-Stars",
                "id": "107077840756"
            },
            "created_time": "2016-05-11T17:14:26+0000"
        },
        {
            "id": "113373749451_10154179732344452",
            "status_type": "shared_story",
            "message": "Ready to ace college costs 101? http://bddy.me/1Wp3ue8",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-11T13:59:47+0000"
        },
        {
            "id": "113373749451_10154177915654452",
            "status_type": "added_photos",
            "message": "A big shoutout to the New York Life Insurance Company Albany General Office and their Managing Partner, Scott Caggiano, who took the plunge for The Moyer Foundation in a dunk tank after a few good \"pitches.\" As part of the New York Life Give for Good Campaign, the Albany General Office set up a dunk tank where Scott allowed those who made contributions to the campaign to take a shot at dunking him – many were successful! Both awareness and funds were raised for The Moyer Foundation at this great event, as well as lots of laughs for New York Life agents and employees. Our thanks to the Albany GO and Scott Caggiano! #NYLGiving",
            "from": {
                "name": "The Moyer Foundation",
                "id": "107886994702"
            },
            "created_time": "2016-05-10T17:45:07+0000"
        },
        {
            "id": "113373749451_10154177631799452",
            "status_type": "added_photos",
            "message": "Maria Collins, New York Life Hudson Valley; 2016 VSA Youth Leader Award Winner, Zach Lewis; Doug Rogers, New York Life Insurance Company",
            "from": {
                "name": "Volunteer New York",
                "id": "116288635048752"
            },
            "created_time": "2016-05-10T15:14:06+0000"
        },
        {
            "id": "113373749451_10154177468594452",
            "status_type": "shared_story",
            "message": "LGBT families: Ensure your future is safe & secure. http://bddy.me/21SwAlW\r #FactsOfLifeInsurance",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-10T13:49:37+0000"
        },
        {
            "id": "113373749451_10154175264909452",
            "status_type": "shared_story",
            "message": "How can you tap into your retirement savings without the risk of outliving it?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-09T14:34:08+0000"
        },
        {
            "id": "113373749451_10154167968269452",
            "status_type": "shared_story",
            "message": "Here's a recap of the RaiseAChild.US #HONORS event from HuffPost Queer Voices with great pics of Alec Mapa & Jamie Hebert, Jillian Michaels & Heidi Rhoades, Lisa Joyner & Jon Cryer, and Gina Bar-ster & Dana Foster. \n\nMany thanks again to CBS, HBO, New York Life Insurance Company, The Jim Henson Company, Penny Lane Centers, Adoptions and Foster Care at Vista Del Mar, Walden Family Services, The Village Family Services, Elsie Green House and Home, Vaughan Benz, Charmean Neithart Interiors, Black Market Liquor Bar, Mauro's Cafe at Fred Segal, Lafayette 148 New York, Kai Loebach, Toyota of Hollywood, LAcarGUY, KTLA 5 News, Hilton Imperial Dubrovnik, Chef Antonia Lofaso, James Michael Bobby, C.A.P's Tours, Southwest Airlines, Hornblower New York, Samuelsohn, Canali, Sheraton New York Times Square, Caribe Hilton, Charlie's Custom Tours Puerto Rico, MLB Network, Gay Parent Magazine, KPL Select Mortgage, Inc., Andrew Manning, C&S Delivery Service, Let's Party L.A. Entertainment, Endless Road Entertainment, Inc., Nydia Barakat, Georgeanne Barrett, Lynne Baumhoff, Sonja Chevere, Brandon Crosby, Jeff Danis, Claire Davis, Work The Room, Danny Fisk, John Gile, Lisa Blackwood, Bryant Huddleston, Dr. Kim Huynh, John Ireland, Evelyne Joan, David Keeton, Mikey Koffman, Stuart Krasnow, Juliet Martzke, Bita Masjedi, Lauren Merrill, Marcel Pariseau, Degen Pener, Debora Ruth Perez, Brian Rosman, Dog and a Duck, Julie Munjack, Noel Ampel, Andaz West Hollywood, Andaz Napa, CBS Sports, Crowne Plaza Redondo Beach and Marina Hotel, Flappers Comedy Club Burbank, Foxy and Fierce Women's Kickboxing Bootcamp, Fresh Brothers, Hastens Los Angeles, Hornblower Cruises & Events San Diego, Hotel Del Cornado, iHeartRadio, iPic Theaters, KidsEmbrace, LACMA Los Angeles County Museum of Art, London Duck Tours, Madame Tussauds Hollywood, Madonna Inn, Mammoth Mountain, Martin Lawrence Galleries, MOCA | The Museum of Contemporary Art, Los Angeles, Moonlight Stage Productions, Muscle Mechanics, Natural History Museum of Los Angeles County, Palm Springs Aerial Tramway, Park Plaza Westminster Bridge Hotel, Ralphs, Salon True, San Diego Marriott Del Mar, San Diego Zoo, Saxony Design Build Inc., Shepard Fairey, TailorByrd, Telepictures Productions, The Cosmopolitan of Las Vegas, The Face Bar, the tasting kitchen, The Walt Disney Company, Tot Squad Los Angeles, Total Wine & More, White House | Black Market, Whole Foods Market and many more!",
            "from": {
                "name": "RaiseAChild.US",
                "id": "475208192502034"
            },
            "created_time": "2016-05-06T15:57:23+0000"
        },
        {
            "id": "113373749451_10154167963044452",
            "status_type": "shared_story",
            "message": "Aaron Dworkin, President of ASAS, talks about how we're providing kids with comprehensive after-school programs, from STEM to life lessons, and have been able to expand our programs in recent years through our partnership with the New York Life Insurance Company Foundation. via U.S. News & World Report: http://www.usnews.com/news/articles/2016-05-05/after-school-all-stars-offers-students-stem-skills-encouragement-and-life-lessons?src=usn_fb",
            "from": {
                "name": "After-School All-Stars",
                "id": "107077840756"
            },
            "created_time": "2016-05-06T15:55:06+0000"
        },
        {
            "id": "113373749451_10154167693974452",
            "status_type": "added_photos",
            "message": "Tell us: What do you admire most about your mom? #MothersDay",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-06T13:42:21+0000"
        },
        {
            "id": "113373749451_10154166043169452",
            "status_type": "added_photos",
            "message": "Special Thanks to New York Life Insurance Company for volunteering their time to help the students from Cross Country Elementary Middle_#247 have a great visit to JA BizTown.",
            "from": {
                "name": "Junior Achievement of Central Maryland",
                "id": "303072678776"
            },
            "created_time": "2016-05-05T20:19:58+0000"
        },
        {
            "id": "113373749451_10154165661484452",
            "status_type": "added_photos",
            "message": "Signature sponsor, New York Life Insurance Company",
            "from": {
                "name": "March of Dimes - Florida Chapter",
                "id": "63496034539"
            },
            "created_time": "2016-05-05T17:07:49+0000"
        },
        {
            "id": "113373749451_10154165661099452",
            "status_type": "added_photos",
            "message": "Signature sponsor, New York Life Insurance Company",
            "from": {
                "name": "March of Dimes - Florida Chapter",
                "id": "63496034539"
            },
            "created_time": "2016-05-05T17:07:35+0000"
        },
        {
            "id": "113373749451_10154182528494452",
            "status_type": "added_photos",
            "message": "New York Life Insurance Company",
            "from": {
                "name": "Mommybites Boston",
                "id": "202138516580516"
            },
            "created_time": "2016-05-05T16:00:00+0000"
        },
        {
            "id": "113373749451_10154165315534452",
            "status_type": "added_photos",
            "message": "Don’t have a pension? You’re not alone. What steps can you take to secure your retirement income?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-05T13:57:34+0000"
        },
        {
            "id": "113373749451_10154165285099452",
            "status_type": "shared_story",
            "message": "Listen to our middle school MC Dante wow the crowd at our 5th Annual Breakfast Benefit. http://bit.ly/24ryizT Listen Now!  The Eagle Academy for Young Men The Eagle Academy for Young Men of Staten Island Eagle Academy for Young Men of Southeast Queens Eagle Academy for Young Men | Newark #soarhigh #eaglemomsrock #pride Scholastic New York Life Insurance Company",
            "from": {
                "name": "The Eagle Academy Foundation, Inc.",
                "id": "345131526168"
            },
            "created_time": "2016-05-05T13:38:28+0000"
        },
        {
            "id": "113373749451_10154163985954452",
            "status_type": "added_photos",
            "message": "We want to thank all the sponsors for our Estrella Awards on April 23rd. Wells FargoDisneyland/California Adventure American HondaSouthern California Edison (SCE)ChevronAetnaKia Motors America AT&T Hispanic Lifestyle  Southwest Airlines Para Todos DMI Direct JPMorgan Chase & Co. U.S. Bank Tributo A Mi Padre Tequila Ortiz Accountancy Group Bodegas Puente de Rus New York Life Insurance Company State Farm Walmart Union Bank TELACU Scholars Alumni Association Comerica Bank Northwestern Mutual El Clasificado RMIInternational Imperial Sprinkler Supply, Inc \n#oc #SoCal",
            "from": {
                "name": "Orange County Hispanic Chamber of Commerce",
                "id": "776756329024373"
            },
            "created_time": "2016-05-04T22:18:55+0000"
        },
        {
            "id": "113373749451_10154163374939452",
            "status_type": "added_photos",
            "message": "Another exciting day yesterday at #iw16 featuring Insperity, IBM, Capital One, BBVA Compass, Comerica Bank, New York Life Insurance Company, and many others!",
            "from": {
                "name": "PeopleFund",
                "id": "237723199604279"
            },
            "created_time": "2016-05-04T17:41:18+0000"
        },
        {
            "id": "113373749451_10154162987844452",
            "status_type": "shared_story",
            "message": "Consider this: 47% of U.S. business owners have no retirement plan in place. Luckily it’s never too late to start. http://bddy.me/1W7y37Z\r #DreamSmallBiz",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2016-05-04T14:16:46+0000"
        },
        {
            "id": "113373749451_1610568275935982",
            "status_type": "added_photos",
            "message": "Just curious as to how NYL responds to discrimination by its registered representatives?",
            "from": {
                "name": "Eugene Green",
                "id": "1488099888182822"
            },
            "created_time": "2016-05-04T12:53:31+0000"
        },
        {
            "id": "113373749451_10154161825189452",
            "status_type": "added_photos",
            "message": "Big thank you to WOWMI for taking my new professional headshot. Let me know what your thoughts on the new look for my brand! \n Visit my page : Aparajitha Bhamidipati, Licensed Agent with New York Life Insurance Company",
            "from": {
                "name": "Aparajitha Bhamidipati, Licensed Agent with New York Life Insurance Company",
                "id": "200334443650174"
            },
            "created_time": "2016-05-04T02:16:53+0000"
        },
        {
            "id": "113373749451_10154161212104452",
            "status_type": "wall_post",
            "message": "I've been dealing with this company for over a month and have gotten misinformation, delays, the run around and has not been a pleasant experience right after losing a loved one. Thanks a lot New York Life u suck!",
            "from": {
                "name": "Valerie Johnson",
                "id": "10208907999047496"
            },
            "created_time": "2016-05-03T20:06:51+0000"
        },
        {
            "id": "113373749451_1100065410073378",
            "status_type": "added_photos",
            "message": "Interview with New York's Life Insurance Company, along with 20+ employers recruiting Tuesday, May 17 for Boston’s 16th Annual Diversity Employment Day Career Fair!\n\nWyndham Boston at Beacon Hill (5 Blossom Street, Boston MA 02114) from 11 AM – 3 PM",
            "from": {
                "name": "Neal Morrison",
                "id": "924448037635117"
            },
            "created_time": "2016-05-03T18:18:02+0000"
        }
    ],
    "paging": {
        "previous": "https://graph.facebook.com/v2.6/113373749451/feed?fields=id,status_type,message,from,created_time&limit=100&since=1466087566&access_token=EAACEdEose0cBAPh4K8frNV8d5unXZAGG1i7ZBbmXlqCV666s8xuOnbrcaCZBGHhR9tX80yzevU2QmZBZB66BCKiBZCgeFZBdMuKP3ocvcuhDd0hapYgW4zmCkgRdrmZAwAIEfiZBUZBjzdFrDm5lBzvrZAZAReW9LBjirlcI5nrALnZBROAZDZD&__paging_token=enc_AdC6LDmiMWRQPQ4By5VtVsYcIEighwMyt2o8OvlZBn0tncuJoiZBEQZBQnHnbsKpGgX9A2eXxlYHXIK6ZALLnZAh6hHF8QP8DOwJrIuiA2D1xCdEzPQZDZD&__previous=1",
        "next": "https://graph.facebook.com/v2.6/113373749451/feed?fields=id,status_type,message,from,created_time&limit=100&since=1325376000&access_token=EAACEdEose0cBAPh4K8frNV8d5unXZAGG1i7ZBbmXlqCV666s8xuOnbrcaCZBGHhR9tX80yzevU2QmZBZB66BCKiBZCgeFZBdMuKP3ocvcuhDd0hapYgW4zmCkgRdrmZAwAIEfiZBUZBjzdFrDm5lBzvrZAZAReW9LBjirlcI5nrALnZBROAZDZD&until=1462299482&__paging_token=enc_AdCY8q73G9BKa0bKbG9RC21xLMsJML8qZAWqrO6qk207Hx5b9ckFm3fiLZBqrcVZBCTHaa0ipCwhjXZAy4ZBDcvmqTJb9"
    }
}