{
    "data": [
        {
            "id": "113373749451_301268303297816",
            "status_type": "shared_story",
            "from": {
                "name": "Catalyst Hb",
                "id": "725229830861478"
            },
            "created_time": "2012-05-31T04:36:55+0000"
        },
        {
            "id": "113373749451_10150946923824452",
            "status_type": "mobile_status_update",
            "message": "Basketball fans: we want to hear from you! \n\nThe draft lottery is this evening. Let us know which team you think will win the lottery, and the player they’re likely to pick on June 28.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-30T20:00:34+0000"
        },
        {
            "id": "113373749451_10150946330154452",
            "status_type": "published_story",
            "message": "Memorial Day has passed, and schools are letting out for the summer. If you have kids, this means that they will be spending more time at home (hooray!). \n\nDid you know that we offer resources to help prepare for the day when they'll be spending less time at home and more time expanding their horizons? \n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-30T15:26:52+0000"
        },
        {
            "id": "113373749451_10150944167374452",
            "message": "According to researcher Harris Interactive, what percentage of Millennials (also known as Gen Y) has saved nothing for retirement? We’ll post the answer tomorrow.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-29T18:15:11+0000"
        },
        {
            "id": "113373749451_363354400379956",
            "status_type": "shared_story",
            "message": "ART OF LIFE is excited to provide New York Life's new Long Beach, California office location with New York Life's first ever Pa2/(Rotational Art Gallery) to feature first, Sky Scape Scenery from photographer, Ron Woolhether http://www.awefoto.com.  Details for the event this June 14th to follow!  http://www.facebook.com/pages/Art-Of-Life/156176971109830?ref=tn_tnmn",
            "from": {
                "name": "Art Of Life",
                "id": "156176971109830"
            },
            "created_time": "2012-05-29T01:59:36+0000"
        },
        {
            "id": "113373749451_10150941046854452",
            "status_type": "mobile_status_update",
            "message": "Today is Memorial Day, the day we honor the men and women who died while serving in the United States Armed Forces. \n\nThese men and women made the ultimate sacrifice to protect the rights and freedoms we enjoy as Americans – what will you be doing to remember them today?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-28T14:01:05+0000"
        },
        {
            "id": "113373749451_10150933718254452",
            "status_type": "mobile_status_update",
            "message": "It’s National Missing Children’s Day: Take a few minutes today to talk to your kids about safety at home, on the Internet, and when they’re out and about. Review important safety tips with them such as: How and when to use 911 and how to locate help at theme parks, sports stadiums, shopping malls, and other public places. Being open, honest, and prepared will help your children feel safer in their world.\n\nDo you have a great safety pointer for kids and teens? Share it on our wall.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-25T13:00:18+0000"
        },
        {
            "id": "113373749451_10150854305162968",
            "status_type": "added_photos",
            "message": "Thank you Dirk Welzien (New York Life Agent in San Ramon, CA), for supporting the Walnut Creek Aquanuts Synchronized Swimming Team during the 2011-2012 season!\n\nIt has been a successful year for WCA! So far our athletes brought home 51 medals in various competitions throughout the country: 22 gold, 15 silver and 14 bronze.  We competed in solos, duets, trios and team competitions with the strongest clubs in the country. More competitions, including the Nationals, are yet to come.\n\nWCA Alumna (Maria Koroleva) will be representing the United States in the Olympic Games in London this summer, plus thirteen WCA swimmers will be representing the Junior/Age Group national teams. \n\nThank you for helping us train future Olympians. Without your help, we would not be able to provide the girls in Walnut Creek, San Ramon and surrounding communities with the training they need to reach their dreams!",
            "from": {
                "name": "Walnut Creek Aquanuts",
                "id": "317072547967"
            },
            "created_time": "2012-05-24T20:03:17+0000"
        },
        {
            "id": "113373749451_10150931258269452",
            "status_type": "mobile_status_update",
            "message": "Hang on – Memorial Day weekend’s almost here! Fill in the blank, “If I could go anywhere this weekend, it would be _____.”",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-24T13:00:23+0000"
        },
        {
            "id": "113373749451_10150928702859452",
            "status_type": "mobile_status_update",
            "message": "We’re always astonished at the cost of living – aren't you? Gas, groceries, utilities... it all adds up. There never seems to be enough for substantial retirement savings. In fact, LIMRA found that 43% of middle-class Americans have saved less than $25K for retirement!\n\nDo you have tips to reduce expenses and increase your savings? Tell us here (we'd love to share them!).",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-23T13:00:30+0000"
        },
        {
            "id": "113373749451_123024334500821",
            "status_type": "shared_story",
            "message": "If you are looking for a job, or have a company that is hiring, please \"LIKE\" our page to receive updates on our upcoming job fairs in New York! \n\nfacebook.com/careercity ",
            "from": {
                "name": "Matt Zeltser",
                "id": "10152022510951444"
            },
            "created_time": "2012-05-23T10:42:52+0000"
        },
        {
            "id": "113373749451_10150926704279452",
            "status_type": "wall_post",
            "message": "Enjoyed doing the In house training program for 30 of their top agents.  Will they be a strong Insurance for a long time? I definitely think its a yes?",
            "from": {
                "name": "Harold A. Mangum Jr",
                "id": "10201342302036712"
            },
            "created_time": "2012-05-22T18:08:17+0000"
        },
        {
            "id": "113373749451_10150926021729452",
            "status_type": "published_story",
            "message": "If you answered C in our poll yesterday – you’re correct! \n\nAccording to a LIMRA report, nearly half (45%) of all consumers said that the most important factor when purchasing life insurance is knowledge. Understanding a product before you buy it is being a responsible consumer, and there’s a ton of resources available to help you do your research before you buy. \n\nWhat are your favorite go-to resources before you make a purchase?\n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-22T13:00:08+0000"
        },
        {
            "id": "113373749451_10150924969579452",
            "status_type": "wall_post",
            "message": "so far, so good",
            "from": {
                "name": "Terri Hill",
                "id": "10208082083229531"
            },
            "created_time": "2012-05-22T02:22:56+0000"
        },
        {
            "id": "113373749451_10150924609584452",
            "status_type": "wall_post",
            "message": "se recomienda por su seriedad y calidad de trabajo al cliente",
            "from": {
                "name": "Mirdren Lugo",
                "id": "1119091628104578"
            },
            "created_time": "2012-05-21T23:07:18+0000"
        },
        {
            "id": "113373749451_10150923167589452",
            "message": "Nearly half of all consumers say this is the most important factor when purchasing life insurance (stay tuned for the answer tomorrow):",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-21T13:00:33+0000"
        },
        {
            "id": "113373749451_10150917906374452",
            "status_type": "mobile_status_update",
            "message": "Today is Armed Forces Day, and we salute the women and men who serve and protect our country. \n\nDo you have friends or family in the armed services? Say “thank you” to them today!",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-19T14:00:32+0000"
        },
        {
            "id": "113373749451_10150915615149452",
            "status_type": "wall_post",
            "message": "I hope my account with you now includes FB stock!",
            "from": {
                "name": "Gnanse Nelson",
                "id": "10152340207276651"
            },
            "created_time": "2012-05-18T16:26:48+0000"
        },
        {
            "id": "113373749451_10150915309059452",
            "status_type": "mobile_status_update",
            "message": "Some cool data from the League of American Bicyclists: From 2001 to 2009, the number of young people (16 to 34-year-olds) who traveled by vehicle dropped 23%. Why? There’s a whole host of reasons, including higher gas prices, improvements in technology that support alternative transportation, and changes in Gen Y’s values and preferences.\n\nToday is National Bike to Work Day. Whether you bike to work, school, or just for fun – it’s good for you and good for our environment: a win-win situation. Do you have a great suggestion for safe biking?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-18T14:23:07+0000"
        },
        {
            "id": "113373749451_10150912815794452",
            "status_type": "shared_story",
            "from": {
                "name": "BreakOut Studios",
                "id": "166146256789705"
            },
            "created_time": "2012-05-17T16:33:03+0000"
        },
        {
            "id": "113373749451_10150912281109452",
            "status_type": "mobile_status_update",
            "message": "It’s National Police Week, a time to say “thank you” to the men and women who work to keep our communities safe and secure. \n\nDo you know a police officer who goes above and beyond the call of duty?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-17T13:00:34+0000"
        },
        {
            "id": "113373749451_10150909221804452",
            "status_type": "mobile_status_update",
            "message": "Yesterday, we asked: \"What's the average expected retirement age is among Americans?\" \n\nThe answer: 64. It’s concerning, however, that 43% of middle-class Americans have saved less than $25,000 for retirement – we feel that everyone should have the retirement they deserve! \n\nHow do you plan to make your money last?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-16T13:00:12+0000"
        },
        {
            "id": "113373749451_10150906427844452",
            "message": "What’s the average expected retirement age among Americans? We’ll post the answer from Life Insurance and Market Research Association (LIMRA) tomorrow.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-15T14:46:30+0000"
        },
        {
            "id": "113373749451_10150903960774452",
            "status_type": "wall_post",
            "message": "Kaitlyn, precious, what's up with the new york life stuff?",
            "from": {
                "name": "Megan Milbourn",
                "id": "573929939406646"
            },
            "created_time": "2012-05-14T17:36:47+0000"
        },
        {
            "id": "113373749451_10150903827594452",
            "status_type": "published_story",
            "message": "What's sets us apart? Through good times and bad, we have never lost sight in who we are or what we believe in. Our policyholders - and the promises we make to them - have always been our number one priority. That will never change.\n\nTake a look at our 2011 Report to Policyholders, here:\n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-14T16:47:04+0000"
        },
        {
            "id": "113373749451_10150900425749452",
            "status_type": "wall_post",
            "message": "Happy Mother's Day to all the Moms!",
            "from": {
                "name": "Claudio Rodrigues",
                "id": "10155567188962355"
            },
            "created_time": "2012-05-13T13:48:47+0000"
        },
        {
            "id": "113373749451_10150898255154452",
            "status_type": "mobile_status_update",
            "from": {
                "name": "Suburbia Roller Derby",
                "id": "124211084297738"
            },
            "created_time": "2012-05-12T18:50:29+0000"
        },
        {
            "id": "113373749451_10150895687219452",
            "status_type": "wall_post",
            "message": "Hi! Looking for agents who want to get involved with our industry here in Kansas City!                                                                                     \r\nWhether you're new to NAIFA, or have been a member for several years, this section provides you with resources geared specifically to your career development needs as a young insurance or financial advisor. We provide you with a variety of tools that you can use to better equip yourself to overcome challenges and achieve your professional goals. Learn ideas on how to grow your business, take advantage of NAIFA's first-rate sales and skills training and receive discounts on a range of professional resources.\r\nNAIFA created the Young Advisors Team (YAT) for members who are 40 years of age and under, or within their first five years in the industry. Purpose is to ensure that young and new advisors receive the vital tools, resources, and networks necessary to succeed in the financial services industry. \r\nThere is no cost associated with being part of YAT; if you're 40 and under or within your first five years in the business, you are automatically part of YAT.\r\nIf you are interested friend YAT, and you will get updates and meeting times! We all have a voice, together we can leave a legacy! \r\n",
            "from": {
                "name": "Yat Greater KC",
                "id": "797101080426773"
            },
            "created_time": "2012-05-11T19:58:37+0000"
        },
        {
            "id": "113373749451_10150895117994452",
            "status_type": "wall_post",
            "message": "My Mom is a nurse and educator. She graduated from Monmonth School of Nursing,Monmonth Hospital,Monmonth,NJ in 1940.She was President of her class.She taught nursing and labatory technology for 20+ years. She was ask by our local hospital to start a cardiac unit. She did and she also shared her knowledge with other nurses. She found out she could not retire(it just wasn't her),so she worked for a long-term care facility. Yes,shewas older than most of her patients. She was awarded the top nursing award \"North Carolina's Great 100 Nurses\". At the time of her award,she had the most \"active years of service\" - 60 years(and she was still working). Finally,at age 92 she did retire. She lives with me & she is 99 years old! Yes,I am planning her 100th Birthday Party. My mother has spent her adult life educating people in healthcare and saving and improving the lives of her patients. I have always been proud of her! She has always been my hero!  ",
            "from": {
                "name": "Carol Ann Pothier",
                "id": "625049160897942"
            },
            "created_time": "2012-05-11T15:54:19+0000"
        },
        {
            "id": "113373749451_10150894924839452",
            "status_type": "published_story",
            "message": "Sunday is Mother’s Day. Click here to pay tribute to your Mom – or perhaps someone who is like a mother to you. ",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-11T15:00:11+0000"
        },
        {
            "id": "113373749451_10150894719244452",
            "status_type": "wall_post",
            "message": "Have been trying for 6 weeks to cancel my policy and noone will call me back or acknowledge the receipt of my paperwork even though I have proof via fax that it was received!  Great customer service people!",
            "from": {
                "name": "Randy Fuller",
                "id": "10202809896600823"
            },
            "created_time": "2012-05-11T13:32:16+0000"
        },
        {
            "id": "113373749451_10150893664139452",
            "status_type": "wall_post",
            "message": "ok",
            "from": {
                "name": "Enz Foronda Paratga",
                "id": "839080066188455"
            },
            "created_time": "2012-05-11T02:48:56+0000"
        },
        {
            "id": "113373749451_10150892872984452",
            "from": {
                "name": "Four Oaks",
                "id": "141435842533537"
            },
            "created_time": "2012-05-10T20:09:51+0000"
        },
        {
            "id": "113373749451_10150892101204452",
            "status_type": "mobile_status_update",
            "message": "It’s National Pet Week, and we’re celebrating the many ways that our pets make a positive impact in our lives. Studies have found that pets can actually help lower people’s anxiety, stress, and even blood pressure, while another found that pet owners showed higher levels of self-esteem and tended to be less lonely than nonowners. \n\nHow does your pet (or pets!) enhance your life?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-10T15:00:05+0000"
        },
        {
            "id": "113373749451_10150891499114452",
            "status_type": "wall_post",
            "message": "why",
            "from": {
                "name": "吳秀蓉",
                "id": "753964524674655"
            },
            "created_time": "2012-05-10T09:53:44+0000"
        },
        {
            "id": "113373749451_10150890618724452",
            "status_type": "wall_post",
            "message": "Can you advise how to switch out my \"old\" agent with someone competent?",
            "from": {
                "name": "Nina Mosley",
                "id": "10202953834196470"
            },
            "created_time": "2012-05-10T00:56:58+0000"
        },
        {
            "id": "113373749451_10150889328284452",
            "status_type": "shared_story",
            "from": {
                "name": "Salt Lake City Living WELL Magazine",
                "id": "263626987050831"
            },
            "created_time": "2012-05-09T15:37:17+0000"
        },
        {
            "id": "113373749451_10150889310389452",
            "status_type": "shared_story",
            "from": {
                "name": "Business Development Institute",
                "id": "217378984959044"
            },
            "created_time": "2012-05-09T15:29:37+0000"
        },
        {
            "id": "113373749451_10150889235629452",
            "status_type": "mobile_status_update",
            "message": "When it comes to teens and money matters, there’s good news and bad news. While most teens agree that money management is important, about one third were not budgeting or managing their money over the past year. However, the number of teens who say they would be independent by ages 25–27 more than doubled from last year (23% in 2012 versus 12% in 2011). \n\nDo you teach your teens how to budget their money? Share your ideas and strategies with us here.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-09T15:00:03+0000"
        },
        {
            "id": "113373749451_10150887832974452",
            "status_type": "wall_post",
            "message": "who started NYL\r\n",
            "from": {
                "name": "Betty Napoli",
                "id": "10205755525112478"
            },
            "created_time": "2012-05-09T02:02:21+0000"
        },
        {
            "id": "113373749451_221907201254901",
            "status_type": "shared_story",
            "message": "many greetings from Beso-Uganda Beso, we want to thank you for supporting the community work.\nwww.besoug.org ",
            "from": {
                "name": "Aaron Bukenya",
                "id": "714497791959872"
            },
            "created_time": "2012-05-08T19:11:17+0000"
        },
        {
            "id": "113373749451_10150886931404452",
            "status_type": "shared_story",
            "from": {
                "name": "The Moyer Foundation",
                "id": "107886994702"
            },
            "created_time": "2012-05-08T19:00:42+0000"
        },
        {
            "id": "113373749451_10150886333849452",
            "status_type": "mobile_status_update",
            "message": "In honor of National Teacher Day, we pay tribute to those men and women who work so hard to make a difference in the lives of kids every day.\n\nA good teacher can change your life and make you see things in a whole new way. How did a teacher make a difference in your life?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-08T15:00:18+0000"
        },
        {
            "id": "113373749451_349849568409123",
            "status_type": "shared_story",
            "message": "https://www.facebook.com/DavesDesignStudio\nClick on the link to like.",
            "from": {
                "name": "David Licht",
                "id": "733496570004149"
            },
            "created_time": "2012-05-08T14:14:50+0000"
        },
        {
            "id": "113373749451_299858713433851",
            "status_type": "shared_story",
            "message": "A huge thank you to New York Life for supporting Camp Erin through The Moyer Foundation. Your commitment to helping grieving children is much appreciated!\n\nhttp://www.denverpost.com/breakingnews/ci_20566369/jamie-moyers-foundation-gets-1-million-from-new?source",
            "from": {
                "name": "MargaretAnn's Program",
                "id": "133618716684999"
            },
            "created_time": "2012-05-07T23:22:13+0000"
        },
        {
            "id": "113373749451_10150875574969452",
            "status_type": "shared_story",
            "from": {
                "name": "The Moyer Foundation",
                "id": "107886994702"
            },
            "created_time": "2012-05-07T22:31:21+0000"
        },
        {
            "id": "113373749451_447270958632898",
            "status_type": "shared_story",
            "message": "The end is here!!! Watch this youtube video to see these prophecies fulfilled in these metaphors in my palms",
            "from": {
                "name": "Haggai Jeffers",
                "id": "668489766593603"
            },
            "created_time": "2012-05-07T18:01:55+0000"
        },
        {
            "id": "113373749451_10150872779599452",
            "status_type": "published_story",
            "message": "Are you married, single, have kids, retired? \n\nEveryone is unique and different, but one thing’s for sure: life insurance is an essential part of your financial plan, no matter what. Answer three quick questions and find out how it can benefit someone like you. ",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-07T15:00:14+0000"
        },
        {
            "id": "113373749451_10150843451744452",
            "status_type": "wall_post",
            "message": "Cortando la grama enmi casa necesito una chela vien eladita para la calor quien mela trae .....?",
            "from": {
                "name": "Bladimir Vela",
                "id": "695799463851830"
            },
            "created_time": "2012-05-05T15:10:25+0000"
        },
        {
            "id": "113373749451_10150843429859452",
            "status_type": "published_story",
            "message": "\"Respect for the rights of others means peace\" - Benito Juarez (1806-1872, Mexican lawyer and politician) \n\nIn honor of Cinco de Mayo - a day that celebrates Mexican heritage, pride, and freedom - we encourage you to seek financial independence! Our planning tools can help: \n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-05T15:00:35+0000"
        },
        {
            "id": "113373749451_259143907516835",
            "status_type": "shared_story",
            "message": "http://www.cdbaby.com/cd/therichardcurtissingers",
            "from": {
                "name": "Richard Curtis",
                "id": "1100110343344458"
            },
            "created_time": "2012-05-05T13:34:21+0000"
        },
        {
            "id": "113373749451_451824704843042",
            "status_type": "shared_story",
            "message": "This is without a doubt the BEST thing to come along since life insurance itself! An absolute MUST HAVE for anyone with a life insurance policy! If your beneficiary doesn't have a code, it is irresponsible, especially when knowing what has been happening with MetLife and other insurers. Newsletters at: http://www.beneficiarycontactservice.com/BCS_Newsletter02.html and http://www.beneficiarycontactservice.com/BCS_Newsletter03.html",
            "from": {
                "name": "Don Brown",
                "id": "10153256221592080"
            },
            "created_time": "2012-05-05T04:41:23+0000"
        },
        {
            "id": "113373749451_257368087694009",
            "status_type": "shared_story",
            "message": "2012 Fund Drive -- URGENT ACTION needed! \n\nWe appeal to the generosity of those supporters who have not yet responded with a contribution. \n\nS.F. Crisis Care is sustained by its donors like you! It has no other substantial source of income to cover annual expenses. The generosity of those who support Survivors of Sudden Deaths like Suicide, Sudden Infant Deaths, Accidents, Traumatic Injury and Violence keeps us going. \n\nS.F. Crisis Care will be unable to continue its normal service if we fail to reach this year's fundraising goal. \n\nIf you can, please support this fundraising campaign! \n\nIf you have ever considered supporting S.F. Crisis Care, this is the moment to act. \n\nPlease send your donation now! \n\nAll the information you need to send a donation can be found at: http://www.crisiscare.us/sf \n\nHere is how you can donate: \nTo make a contribution by good ol' paper check, just mail your donation to: \n\nS.F. Crisis Care \nP.O. Box 193046 \nSan Francisco, CA 94119 \n\nTo contribute online, just go to www.crisiscare.us/sf \nHit DONATE button. There you can: \n\nTo make regular periodic contributions from your checking account, you can set that up through your bank's free online billpay system. \n\nTo make either a one-time or regular contributions with your credit or check card. Click there to go to our secure donations page at Network For Good.\n\nYours in the Spirit of Service,\n\nChristoph Sandoval",
            "from": {
                "name": "R Christoph Sandoval",
                "id": "717771854939171"
            },
            "created_time": "2012-05-04T16:51:04+0000"
        },
        {
            "id": "113373749451_10150829922039452",
            "status_type": "published_story",
            "message": "Are you a mentor to kids and/or teens? \n\nMay is National Foster Care Month. With an estimated 408,000 kids currently in out-of-home foster care, we encourage you to get involved and make a positive impact on a young life. And, for resources on supporting grieving kids, follow the link below. \n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-04T15:00:28+0000"
        },
        {
            "id": "113373749451_10150822346589452",
            "status_type": "shared_story",
            "from": {
                "name": "Hurricane Island Outward Bound School",
                "id": "193163997430762"
            },
            "created_time": "2012-05-03T18:33:12+0000"
        },
        {
            "id": "113373749451_10150820518419452",
            "status_type": "published_story",
            "message": "Women are a powerful group: Women worldwide make or influence at least 64% of all purchases in a wide variety of categories. In addition, some 23% of married women now out earn their husbands. With all this success comes a greater need for financial knowledge and responsibility. Our resources can help you take charge of your financial future. \n\nWho manages the budget in your household? ",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-03T15:00:34+0000"
        },
        {
            "id": "113373749451_10150817724974452",
            "status_type": "shared_story",
            "from": {
                "name": "The Young Latino Network",
                "id": "134710567509"
            },
            "created_time": "2012-05-03T11:01:09+0000"
        },
        {
            "id": "113373749451_358521450871915",
            "status_type": "shared_story",
            "message": "Learn about Complicated Grief.  Dr Katherine Shear, a pioneer in grief research appeared on CBS news\n\n",
            "from": {
                "name": "Stephanie Tyson Muldberg",
                "id": "10204948334006441"
            },
            "created_time": "2012-05-02T23:41:32+0000"
        },
        {
            "id": "113373749451_10150809835609452",
            "status_type": "wall_post",
            "message": "Have the politicians save Social Security........\n",
            "from": {
                "name": "Donna Gargano",
                "id": "10201629845298278"
            },
            "created_time": "2012-05-02T14:08:15+0000"
        },
        {
            "id": "113373749451_10150809798354452",
            "status_type": "mobile_status_update",
            "message": "The most recent data (2010) shows that 1 in 8 Americans is 65 years or older. May is Older Americans Month - recognizing the achievements and contributions of older Americans. \n\nCan you think of a great way to get involved? Share your ideas on our wall!",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-02T13:55:40+0000"
        },
        {
            "id": "113373749451_10150804971669452",
            "status_type": "wall_post",
            "message": "i'm look for job plz help me qualifications is (call center or cleaning ) & grade 11 don't pass my matric but i have a statement for grade 12 \r\n",
            "from": {
                "name": "Nora Mamcy",
                "id": "970712646359271"
            },
            "created_time": "2012-05-01T18:37:12+0000"
        },
        {
            "id": "113373749451_10150804776474452",
            "status_type": "wall_post",
            "message": "fishing",
            "from": {
                "name": "Linda Ray",
                "id": "869481996448545"
            },
            "created_time": "2012-05-01T17:13:20+0000"
        },
        {
            "id": "113373749451_10150804404729452",
            "status_type": "added_photos",
            "message": "Happy May Day! Fill in the blank, “In May, I am most looking forward to _____.”",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-05-01T14:47:13+0000"
        },
        {
            "id": "113373749451_403973676289845",
            "status_type": "shared_story",
            "message": "As a supporter of Little League, we'd love it if you would check us out! We're a line of Little League jewellery that shows pride and preserves memories.\n\nhttp://www.homefreebaseball.com/",
            "from": {
                "name": "Home Free Baseball Jewelry",
                "id": "402767679741862"
            },
            "created_time": "2012-04-30T18:44:27+0000"
        },
        {
            "id": "113373749451_426713494022845",
            "status_type": "shared_story",
            "message": "A study conducted in 2011 revealed that 44% of boomers feel they will not be able to afford to do the things they want to do in retirement. In addition, 36% of boomers said they feel they may not be able to retire at all, and 33% feel they may have to struggle to make ends meet during retirement. \n\nWhat steps are you taking to plan for your retirement? ",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-30T15:34:27+0000"
        },
        {
            "id": "113373749451_10150801802694452",
            "status_type": "mobile_status_update",
            "from": {
                "name": "West Side YMCA",
                "id": "138015662913471"
            },
            "created_time": "2012-04-30T15:31:00+0000"
        },
        {
            "id": "113373749451_10150794154944452",
            "status_type": "shared_story",
            "from": {
                "name": "The Moyer Foundation",
                "id": "107886994702"
            },
            "created_time": "2012-04-27T19:39:05+0000"
        },
        {
            "id": "113373749451_10150793551099452",
            "status_type": "published_story",
            "message": "First Pitch: Little League Baseball and Softball is beginning soon, and today we celebrate Babe Ruth Day! We’ve always been inspired by Babe Ruth and his commitment to helping kids in his community.\n\nYou can help young sluggers in your own neighborhood, too! Drop off gently used baseball and softball equipment at your local New York Life office. Click the link to find out more!\n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-27T15:00:33+0000"
        },
        {
            "id": "113373749451_10150792168919452",
            "status_type": "mobile_status_update",
            "from": {
                "name": "The Young Latino Network",
                "id": "134710567509"
            },
            "created_time": "2012-04-27T02:06:16+0000"
        },
        {
            "id": "113373749451_10150791936504452",
            "status_type": "wall_post",
            "message": "delete",
            "from": {
                "name": "Linda Johnson McCullough",
                "id": "10205305451505792"
            },
            "created_time": "2012-04-26T23:37:12+0000"
        },
        {
            "id": "113373749451_10150791279579452",
            "from": {
                "name": "America Scores NY",
                "id": "81111157895"
            },
            "created_time": "2012-04-26T18:15:35+0000"
        },
        {
            "id": "113373749451_10150790846054452",
            "status_type": "mobile_status_update",
            "message": "Inspire, educate, and empower your kids to discover the possibilities of a career -- it's Take Our Daughters and Sons to Work Day.\n\nWhat kinds of fun and enriching activities are your kids taking part in today?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-26T15:00:20+0000"
        },
        {
            "id": "113373749451_10150790755764452",
            "status_type": "shared_story",
            "from": {
                "name": "MainStay Investments & New York Life Annuities",
                "id": "195630873823391"
            },
            "created_time": "2012-04-26T14:11:46+0000"
        },
        {
            "id": "113373749451_10150790470239452",
            "status_type": "shared_story",
            "from": {
                "name": "The Young Latino Network",
                "id": "134710567509"
            },
            "created_time": "2012-04-26T11:19:20+0000"
        },
        {
            "id": "113373749451_10150788747939452",
            "message": "Tax Day is over! What do you plan to do with your tax refund?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-25T18:49:50+0000"
        },
        {
            "id": "113373749451_10150788267069452",
            "status_type": "published_story",
            "message": "FACT: Women are living longer than men, and they need to plan their finances accordingly.\n\nIn 2010, 40% of women over 65 were widows and almost half of women 75 or older lived alone – startlingly enough, this group's median annual income is just $15,000. \n\nWomen, how are you empowering yourself for a secure and longer-lasting  financial future?\n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-25T15:00:34+0000"
        },
        {
            "id": "113373749451_10150785731089452",
            "status_type": "published_story",
            "message": "Having a child with special needs touches many lives: According to the Center for Disease Control, new data shows an average of 1 in 88 children has been identified with an Autism Spectrum Disorder (ASD). \n\nSpecial needs planning can help ensure your loved ones lead financially secure lives. We can help provide resources and information to help you get started. \n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-24T15:00:16+0000"
        },
        {
            "id": "113373749451_10150783138549452",
            "status_type": "mobile_status_update",
            "message": "Studies show that 88% of 18-34 year-olds say that they either earn enough money now, or that they expect to earn enough in the future to lead the kind of life they want. We think this kind of “economic optimism” is great, and encourage you to plan for your future financial security now (regardless of your age!). \n\nWhat’s your best resource for staying informed about your finances?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-23T15:48:21+0000"
        },
        {
            "id": "113373749451_10150782604054452",
            "status_type": "shared_story",
            "from": {
                "name": "The Young Latino Network",
                "id": "134710567509"
            },
            "created_time": "2012-04-23T10:54:19+0000"
        },
        {
            "id": "113373749451_10150780654349452",
            "status_type": "mobile_status_update",
            "message": "Is there a park or school in your local community that could use a cleanup? \n\nIn honor of Earth Day, why not head over there and spend a little time cleaning it up, or planting some trees? Remember, every little bit makes a difference.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-22T15:35:50+0000"
        },
        {
            "id": "113373749451_10150776998264452",
            "status_type": "mobile_status_update",
            "from": {
                "name": "Abt Electronics",
                "id": "39878856919"
            },
            "created_time": "2012-04-20T20:02:56+0000"
        },
        {
            "id": "113373749451_10150776762659452",
            "status_type": "mobile_status_update",
            "from": {
                "name": "The Moyer Foundation",
                "id": "107886994702"
            },
            "created_time": "2012-04-20T18:05:48+0000"
        },
        {
            "id": "113373749451_10150776429879452",
            "status_type": "published_story",
            "message": "We’d like to recognize everyone who gives time to help grieving kids in their local communities. You all rock! \n\nIt’s Volunteer Recognition Day, give kudos to a volunteer you know – right here on our Page. ",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-20T15:03:51+0000"
        },
        {
            "id": "113373749451_10150775501614452",
            "status_type": "mobile_status_update",
            "message": "Gimme five! Yes, today is “National High Five Day” and a good excuse to celebrate the little victories in life.\n\nWhat did you accomplish in the past month?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-20T03:00:11+0000"
        },
        {
            "id": "113373749451_10150774482654452",
            "status_type": "mobile_status_update",
            "message": "Today is Holocaust Remembrance Day. Please join us in taking a moment to remember the millions of people killed during the Holocaust, and to also recognize those who survived and were able to share their stories with future generations. Let's all pledge to never forget what happened, and to help do our part to ensure that racism, bigotry, and hatred towards others is not tolerated.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-19T16:27:35+0000"
        },
        {
            "id": "113373749451_10150770749359452",
            "status_type": "wall_post",
            "message": "we were just wondering if u have ever had a sign that is engraved steel wth the emble being an eagle flying to a nest with chicks in it we have 1 that we got about 20 years ago in the roof of our house the house was an old chemist and insurance shop",
            "from": {
                "name": "Marion Wiese",
                "id": "1334175286597197"
            },
            "created_time": "2012-04-19T10:58:33+0000"
        },
        {
            "id": "113373749451_10150769389704452",
            "status_type": "wall_post",
            "message": "my wife is an agent advisor of Max New York life insurance company in India.her code is 306005.she had qualified for laptop competetion during March 2011;but MNyLIC have not given laptop even after our several reminders to the company.your company is a cheater in India.kindly look into the matter seriously.",
            "from": {
                "name": "DrCa Pradeep Kumar Jhunjhunwala",
                "id": "10203739006188494"
            },
            "created_time": "2012-04-19T10:10:31+0000"
        },
        {
            "id": "113373749451_10150765557524452",
            "status_type": "mobile_status_update",
            "message": "It's National Poetry Month! Can you create a haiku using the words “strength” and “humanity”?\n\nRemember, a haiku is comprised of three lines: the first using five syllables, the second using seven syllables, and the third using five syllables again.",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-18T15:00:19+0000"
        },
        {
            "id": "113373749451_10150764737414452",
            "status_type": "wall_post",
            "message": "Does anyone happen to know how long a life insurance check takes to clear once you deposit it in your bank account?",
            "from": {
                "name": "Chris Blue",
                "id": "458315920968364"
            },
            "created_time": "2012-04-18T04:23:18+0000"
        },
        {
            "id": "113373749451_291147817626558",
            "status_type": "shared_story",
            "message": "Saving just $5 a day adds up to $1,825 a year. That’s a pretty impressive amount for a small daily commitment! But while you're looking for ways to reduce your budget, LIFE Happens advises that cancelling your life insurance shouldn’t be one of them.\n\nHave you cut something from your budget to save a bit more for a rainy day?\n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-17T14:55:52+0000"
        },
        {
            "id": "113373749451_10150761927784452",
            "status_type": "wall_post",
            "message": "Any help out there on getting NYL to pay a claim on my husband's life policy?",
            "from": {
                "name": "Phyllis Williams",
                "id": "1001225043226077"
            },
            "created_time": "2012-04-16T21:55:07+0000"
        },
        {
            "id": "113373749451_153179348143978",
            "status_type": "shared_story",
            "message": "Reminder: Tomorrow, April 17, is the deadline to file your 2011 taxes. \n\nCompleting your taxes can help you perform a financial pulse check – helping you to identify areas where you can potentially make changes, save more, and so on. Need more guidance? Our agents can help – providing assistance every step of the way.\n",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-16T20:42:01+0000"
        },
        {
            "id": "113373749451_10150761510184452",
            "from": {
                "name": "The National Society of Collegiate Scholars",
                "id": "9523407602"
            },
            "created_time": "2012-04-16T18:27:15+0000"
        },
        {
            "id": "113373749451_10150761326119452",
            "status_type": "mobile_status_update",
            "message": "Today is National Stress Awareness Day. Stress can manifest itself in many ways, and can wreak havoc on your life and health. \n\nWhat methods do you have for reducing stress?",
            "from": {
                "name": "New York Life Insurance Company",
                "id": "113373749451"
            },
            "created_time": "2012-04-16T16:54:24+0000"
        },
        {
            "id": "113373749451_269401779816687",
            "status_type": "shared_story",
            "message": "http://www.facebook.com/pages/Gradasi-Production/123390417695439?ref=tn_tnmn",
            "from": {
                "name": "Gradasi Production",
                "id": "123390417695439"
            },
            "created_time": "2012-04-16T16:48:03+0000"
        },
        {
            "id": "113373749451_10150759758774452",
            "status_type": "wall_post",
            "message": "Mitunam ye sooal beporsam?",
            "from": {
                "name": "Asghar Hajipour",
                "id": "879008542224819"
            },
            "created_time": "2012-04-15T23:14:38+0000"
        },
        {
            "id": "113373749451_10150759016824452",
            "status_type": "wall_post",
            "message": "boooooooooooooo",
            "from": {
                "name": "Kendrix Ramos",
                "id": "906147039507607"
            },
            "created_time": "2012-04-15T16:46:13+0000"
        },
        {
            "id": "113373749451_10150755133569452",
            "status_type": "wall_post",
            "message": "Linh tao co thay them hinh gi dau??",
            "from": {
                "name": "Dieuoanh Truong",
                "id": "906988616079063"
            },
            "created_time": "2012-04-13T19:26:26+0000"
        },
        {
            "id": "113373749451_244036809028350",
            "status_type": "shared_story",
            "message": "FOLLOW TWITTER: @Skandal_Tube\n",
            "from": {
                "name": "Noval Mrafi",
                "id": "1163734246974257"
            },
            "created_time": "2012-04-13T18:24:51+0000"
        },
        {
            "id": "113373749451_10150754938534452",
            "status_type": "wall_post",
            "message": "yawn:)",
            "from": {
                "name": "Jack Warszawski",
                "id": "10204401123562721"
            },
            "created_time": "2012-04-13T17:59:07+0000"
        }
    ],
    "paging": {
        "previous": "https://graph.facebook.com/v2.6/113373749451/feed?fields=id,status_type,message,from,created_time&limit=100&since=1338439015&__paging_token=enc_AdCUeZB8PxvmMgvw1Yqc8bQgJsdqTMAfqRcWHdQSn8iyQliFhxTKMiEgQsmZCUgXJZBT186jFQRozUoUt90ZArHuaAj4&access_token=EAACEdEose0cBAPh4K8frNV8d5unXZAGG1i7ZBbmXlqCV666s8xuOnbrcaCZBGHhR9tX80yzevU2QmZBZB66BCKiBZCgeFZBdMuKP3ocvcuhDd0hapYgW4zmCkgRdrmZAwAIEfiZBUZBjzdFrDm5lBzvrZAZAReW9LBjirlcI5nrALnZBROAZDZD&__previous=1",
        "next": "https://graph.facebook.com/v2.6/113373749451/feed?fields=id,status_type,message,from,created_time&limit=100&since=1325376000&__paging_token=enc_AdBYFJY0J1JKS0tRjuHbrFlN0AZCS5YwGTIlCWnhk1RhLfTf6AXB2E0LYJvZA0PMHzqLu0ZAn27LYAXVhJKajDjzTzKnIx1c3PodZCd8kDGCYZAY5HQZDZD&access_token=EAACEdEose0cBAPh4K8frNV8d5unXZAGG1i7ZBbmXlqCV666s8xuOnbrcaCZBGHhR9tX80yzevU2QmZBZB66BCKiBZCgeFZBdMuKP3ocvcuhDd0hapYgW4zmCkgRdrmZAwAIEfiZBUZBjzdFrDm5lBzvrZAZAReW9LBjirlcI5nrALnZBROAZDZD&until=1334339947"
    }
}